org/2021-09-25-video-game-reviews.org
#+OPTIONS: toc:nil num:nil
#+BEGIN_EXPORT html
---
layout: post
title: "Video Game Reviews"
permalink: /video-game-reviews/
tags: [reviews, video games]
---
#+END_EXPORT
* 007: Nightfire
The single-player campaign is surprisingly deep thanks to challenges, some open levels, and plenty of weapons, but the package is rounded out by a great multiplayer mode with AI bots, a rarity at the time.

4/5
* 13 Sentinels: Aegis Rim
The best-told narrative I've ever seen in a game. Gripping for all 30+ hours, and had me constantly thinking about how all its pieces fit together. Superb localization and art.

5/5
* Advance Wars
While surpassed by its sequels, it's still a fantastically accessible tactical game offering a trifecta of a cute campaign, endlessly replayable multiplayer, and "war room" missions. War has never been this adorable.

4/5
* Advance Wars 2: Black Hole Rising
Everything great about /Advance Wars/ turned up. A better and more varied campaign, more COs, more maps, more terrain, and one new unit, the unnecessary Neotank. One of the GBA's greatest.

5/5
* Advance Wars: Days of Ruin
It's better balanced than prior games in the series, though the grittiness is just bland and the final mission is brutal and unfun. But the heart of /Advance Wars/ remains, which is what matters most.

4/5
* Advance Wars: Dual Strike
Even more stuff than /Black Hole Rising/! Sure, the new units are terribly balanced and situational and the new COs aren't great, but everything from before is here. The hard mode campaign is completely broken, but the freedom to choose your COs and abilities means that you're even more busted, allowing for some fun puzzle-y battles where prior strategizing is more important than usual.

5/5
* A Hat in Time
The best retro 3D platformer in a while, sure to satisfy fans yearning for something in the /Super Mario Sunshine/ vein. Lives up to its "cute as heck" billing.

4/5
* Altitude
I put a lot of time into /Altitude/, a 2D plane combat game, especially "ball" mode, which was essentially plane rugby/soccer. Pleasing movement and combat with a high skill ceiling and multiple loadouts for depth.

4/5
* ARMS
The main thing going for it is that it came out at a time when the Switch had almost no other games.

3/5
* Artifact
If it were free, people would still be playing this. Instead, it's a dead game. Drafting was a delight, constructed was pay-to-win, much like Richard Garfield's most famous card game. Made good use of the digital space with its mechanics, and I would have loved to have seen what they had for future card sets. Some very frustrating randomness.

4/5
* Assassin's Creed
I do not enjoy sitting on benches in a very pretty rendition of the Middle East. Where are all the assassinations? What's with the modern-day segments? (A question I'm told is still asked about the other 20ish games.)

3/5
* Astral Chain
The combat isn't deep enough to hold interest. But even though it's still the best part of the game, it's surrounded by entirely too much padding and time-wasting, and the highest difficulty allowed on a first playthrough is boringly easy except for the final boss' difficulty spike, ignorable with all the revive items you never used. Silent protagonist was a bad choice.

3/5
* BaBa Is You
Ingenious. Breaks my brain. Got stuck at some point and have no desire to go back, though.

4/5
* Banjo-Kazooie
The best platformer on the N64, one which I still revisit on a quiet Saturday every few years to 100%. Rewarding movement, compact but dense levels, and a delightful score make it a treat every time.

5/5
* Bastion
The gameplay is fine, but basic. A narrative that isn't all that interesting is held back by being told through voiceovers while you're in the middle of trying not to die. Great soundtrack. A game that crawled so that /Hades/ could run.

3/5
* Battalion Wars
It's a somewhat bizarre hybrid of RTS and shooter. The balance between the two gives a bit of a "rubbing your belly while patting your head" feel to help conceal the lack of depth of either, and especially the vehicles and aircraft are fun to control. Mission variety is also respectable.

4/5
* Battlefield 1943
A streamlined, or perhaps refined, multiplayer /Battlefield/ experience.

4/5
* Bayonetta
I don't care for beat-em-ups, but it's fast, stylish, and different.

4/5
* Bayonetta 2
Same as the original, but with more variety in weapons and enemies.

4/5
* BioShock
Boy do I wish more games were written at a level that assumes a working knowledge of Objectivism. I'm here for the art design, the writing, and the rare ludonarrative concordance in a AAA game; the shooting mechanics are unremarkable by today's standards.

5/5
* BioShock 2
Very obviously made without Ken Levine. And without an auteur, it's just another mechanically competent bland shooter with nothing to say. I did like the Minerva's Den DLC, whose story is interesting enough to carry its few hours.

3/5
* BioShock: Infinite
A tour de force of worldbuilding, characterization, and story, with the latter especially leaving me processing it for days. One of my all-time favorites.

5/5
* Bowser's Fury
As an experiment in the /Mario/ formula, it's a failure: the Bowser interruptions are annoying, having objectives that can only be done during these infrequent, uncontrollable segments is unusually hostile to the player, and the open world doesn't really add anything to what is, at its heart, a series of disconnected /64/-style vignettes. And those levels and platforming are fun, but there's nothing new there.

4/5
* BoxBoy! + BoxGirl!
A light puzzle game perfect for a few evenings with a loved one.

4/5
