_posts/2021-09-25-video-game-reviews.html
---
layout: post
title: "Video Game Reviews"
permalink: /video-game-reviews/
tags: [reviews, video games]
---
<div id="outline-container-org5440de6" class="outline-2">
<h2 id="org5440de6">007: Nightfire</h2>
<div class="outline-text-2" id="text-org5440de6">
<p>
The single-player campaign is surprisingly deep thanks to challenges, some open levels, and plenty of weapons, but the package is rounded out by a great multiplayer mode with AI bots, a rarity at the time.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgec52538" class="outline-2">
<h2 id="orgec52538">13 Sentinels: Aegis Rim</h2>
<div class="outline-text-2" id="text-orgec52538">
<p>
The best-told narrative I&rsquo;ve ever seen in a game. Gripping for all 30+ hours, and had me constantly thinking about how all its pieces fit together. Superb localization and art.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org038638a" class="outline-2">
<h2 id="org038638a">Advance Wars</h2>
<div class="outline-text-2" id="text-org038638a">
<p>
While surpassed by its sequels, it&rsquo;s still a fantastically accessible tactical game offering a trifecta of a cute campaign, endlessly replayable multiplayer, and &ldquo;war room&rdquo; missions. War has never been this adorable.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org80a3c1c" class="outline-2">
<h2 id="org80a3c1c">Advance Wars 2: Black Hole Rising</h2>
<div class="outline-text-2" id="text-org80a3c1c">
<p>
Everything great about <i>Advance Wars</i> turned up. A better and more varied campaign, more COs, more maps, more terrain, and one new unit, the unnecessary Neotank. One of the GBA&rsquo;s greatest.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgfc1c893" class="outline-2">
<h2 id="orgfc1c893">Advance Wars: Days of Ruin</h2>
<div class="outline-text-2" id="text-orgfc1c893">
<p>
It&rsquo;s better balanced than prior games in the series, though the grittiness is just bland and the final mission is brutal and unfun. But the heart of <i>Advance Wars</i> remains, which is what matters most.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgea2d09c" class="outline-2">
<h2 id="orgea2d09c">Advance Wars: Dual Strike</h2>
<div class="outline-text-2" id="text-orgea2d09c">
<p>
Even more stuff than <i>Black Hole Rising</i>! Sure, the new units are terribly balanced and situational and the new COs aren&rsquo;t great, but everything from before is here. The hard mode campaign is completely broken, but the freedom to choose your COs and abilities means that you&rsquo;re even more busted, allowing for some fun puzzle-y battles where prior strategizing is more important than usual.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orge11caaf" class="outline-2">
<h2 id="orge11caaf">A Hat in Time</h2>
<div class="outline-text-2" id="text-orge11caaf">
<p>
The best retro 3D platformer in a while, sure to satisfy fans yearning for something in the <i>Super Mario Sunshine</i> vein. Lives up to its &ldquo;cute as heck&rdquo; billing.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org121d7a2" class="outline-2">
<h2 id="org121d7a2">Altitude</h2>
<div class="outline-text-2" id="text-org121d7a2">
<p>
I put a lot of time into <i>Altitude</i>, a 2D plane combat game, especially &ldquo;ball&rdquo; mode, which was essentially plane rugby/soccer. Pleasing movement and combat with a high skill ceiling and multiple loadouts for depth.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org28fbfa9" class="outline-2">
<h2 id="org28fbfa9">ARMS</h2>
<div class="outline-text-2" id="text-org28fbfa9">
<p>
The main thing going for it is that it came out at a time when the Switch had almost no other games.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org4e08c41" class="outline-2">
<h2 id="org4e08c41">Artifact</h2>
<div class="outline-text-2" id="text-org4e08c41">
<p>
If it were free, people would still be playing this. Instead, it&rsquo;s a dead game. Drafting was a delight, constructed was pay-to-win, much like Richard Garfield&rsquo;s most famous card game. Made good use of the digital space with its mechanics, and I would have loved to have seen what they had for future card sets. Some very frustrating randomness.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org374858f" class="outline-2">
<h2 id="org374858f">Assassin&rsquo;s Creed</h2>
<div class="outline-text-2" id="text-org374858f">
<p>
I do not enjoy sitting on benches in a very pretty rendition of the Middle East. Where are all the assassinations? What&rsquo;s with the modern-day segments? (A question I&rsquo;m told is still asked about the other 20ish games.)
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgeaabafb" class="outline-2">
<h2 id="orgeaabafb">Astral Chain</h2>
<div class="outline-text-2" id="text-orgeaabafb">
<p>
The combat isn&rsquo;t deep enough to hold interest. But even though it&rsquo;s still the best part of the game, it&rsquo;s surrounded by entirely too much padding and time-wasting, and the highest difficulty allowed on a first playthrough is boringly easy except for the final boss&rsquo; difficulty spike, ignorable with all the revive items you never used. Silent protagonist was a bad choice.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org9afe915" class="outline-2">
<h2 id="org9afe915">BaBa Is You</h2>
<div class="outline-text-2" id="text-org9afe915">
<p>
Ingenious. Breaks my brain. Got stuck at some point and have no desire to go back, though.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org53f3deb" class="outline-2">
<h2 id="org53f3deb">Banjo-Kazooie</h2>
<div class="outline-text-2" id="text-org53f3deb">
<p>
The best platformer on the N64, one which I still revisit on a quiet Saturday every few years to 100%. Rewarding movement, compact but dense levels, and a delightful score make it a treat every time.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgcc48475" class="outline-2">
<h2 id="orgcc48475">Bastion</h2>
<div class="outline-text-2" id="text-orgcc48475">
<p>
The gameplay is fine, but basic. A narrative that isn&rsquo;t all that interesting is held back by being told through voiceovers while you&rsquo;re in the middle of trying not to die. Great soundtrack. A game that crawled so that <i>Hades</i> could run.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgdb7eaa5" class="outline-2">
<h2 id="orgdb7eaa5">Battalion Wars</h2>
<div class="outline-text-2" id="text-orgdb7eaa5">
<p>
It&rsquo;s a somewhat bizarre hybrid of RTS and shooter. The balance between the two gives a bit of a &ldquo;rubbing your belly while patting your head&rdquo; feel to help conceal the lack of depth of either, and especially the vehicles and aircraft are fun to control. Mission variety is also respectable.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org3d8a20c" class="outline-2">
<h2 id="org3d8a20c">Battlefield 1943</h2>
<div class="outline-text-2" id="text-org3d8a20c">
<p>
A streamlined, or perhaps refined, multiplayer <i>Battlefield</i> experience.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org65df264" class="outline-2">
<h2 id="org65df264">Bayonetta</h2>
<div class="outline-text-2" id="text-org65df264">
<p>
I don&rsquo;t care for beat-em-ups, but it&rsquo;s fast, stylish, and different.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org3bf8de8" class="outline-2">
<h2 id="org3bf8de8">Bayonetta 2</h2>
<div class="outline-text-2" id="text-org3bf8de8">
<p>
Same as the original, but with more variety in weapons and enemies.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgd2155a2" class="outline-2">
<h2 id="orgd2155a2">BioShock</h2>
<div class="outline-text-2" id="text-orgd2155a2">
<p>
Boy do I wish more games were written at a level that assumes a working knowledge of Objectivism. I&rsquo;m here for the art design, the writing, and the rare ludonarrative concordance in a AAA game; the shooting mechanics are unremarkable by today&rsquo;s standards.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org2507d32" class="outline-2">
<h2 id="org2507d32">BioShock 2</h2>
<div class="outline-text-2" id="text-org2507d32">
<p>
Very obviously made without Ken Levine. And without an auteur, it&rsquo;s just another mechanically competent bland shooter with nothing to say. I did like the Minerva&rsquo;s Den DLC, whose story is interesting enough to carry its few hours.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org1b5cdc5" class="outline-2">
<h2 id="org1b5cdc5">BioShock: Infinite</h2>
<div class="outline-text-2" id="text-org1b5cdc5">
<p>
A tour de force of worldbuilding, characterization, and story, with the latter especially leaving me processing it for days. One of my all-time favorites.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgd1f1d4c" class="outline-2">
<h2 id="orgd1f1d4c">Bowser&rsquo;s Fury</h2>
<div class="outline-text-2" id="text-orgd1f1d4c">
<p>
As an experiment in the <i>Mario</i> formula, it&rsquo;s a failure: the Bowser interruptions are annoying, having objectives that can only be done during these infrequent, uncontrollable segments is unusually hostile to the player, and the open world doesn&rsquo;t really add anything to what is, at its heart, a series of disconnected <i>64</i>-style vignettes. And those levels and platforming are fun, but there&rsquo;s nothing new there.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgb275f7b" class="outline-2">
<h2 id="orgb275f7b">BoxBoy! + BoxGirl!</h2>
<div class="outline-text-2" id="text-orgb275f7b">
<p>
A light puzzle game perfect for a few evenings with a loved one.
</p>

<p>
4/5
</p>
</div>
</div>
