org/2021-09-25-video-game-reviews.org
* Cadence of Hyrule
A delightful bite-sized mashup of /Crypt of the NecroDancer/ and /The Legend of Zelda/.
Very accessible, to the point of being a little easy even as someone who's terrible at /NecroDancer/, but doesn't overstay its welcome.

4/5
* Call of Duty 4: Modern Warfare
How spoiled we were in 2007 to have had this and /Halo 3/ drop within a few weeks of each other. The campaign was unrelenting action, filled with set pieces and levels; [[https://en.wikipedia.org/wiki/All_Ghillied_Up]["All Ghillied Up"]] has its own Wikipedia page, for crying out loud. The multiplayer took that relentlessness even further with its fast time-to-kill, and it was a masterclass in player engagement. Before the industry switched over to Skinner boxes and pay-to-win monetization, /COD4/ had a constant drip of weapons and challenges, with the hamster wheel prestige system. Everything was done to excite our monkey brains, especially that little crosshair that would come up when hitting an opponent. This was a game that felt /good/ to play.

5/5
* Cassette Beasts
Shows how much Pokémon is held down by being Pokémon. Flexible builds, adjustable difficulty, and gameplay beyond using super effective moves. Simple story, but more interesting and tender than simply being the very best.

4/5
* Castle Crashers
Casual beat 'em up simple enough for easy coop but with enough characters and gear to keep it interesting.

4/5
* Castle of Illusion Starring Mickey Mouse
Once upon a time, licensed platformers were everywhere, and back in the late 80s and early 90s, many weren't half-bad. /Castle of Illusion/ stands out thanks to its all-over-the-place level themes and enjoyable bounce-based platforming, a core revisited later by games like /Shovel Knight/.

4/5
* Catherine: Full Body
There's the devious puzzle game half, with many a fist pump after a completed level. But this is Atlus, so there's also a fascinating and messy dating simulator half. I love many of the mature themes of love and adulthood, the art design, and Shoji Meguro's score filled with classical-inspired pieces. Certain aspects of the characters and their relationships are lacking, the LGBT themes are, at my most charitable, clumsily handled, and the final act(s) can go off the rails in terms of narrative and tone. Still, this is a crafted experience, and something I want to see more of in the medium.

4/5
* Cave Story+
The original indie labor of love that paved the way for so many others. The tight movement/combat is enough, but it's a charming story and a truly outstanding score (I prefer the original compositions over the remixes, but the graphical updates are an improvement).

5/5
* Celeste
The absolute best 2D platforming has to offer. Tough as nails, but never frustrating thanks to quick respawns and per-screen checkpoints. Beautifully integrates a touching story with its gameplay.

5/5
* Clubhouse Games
At the time, a collection of perfectly cromulent games, especially on the cards front (Spit, Hearts, President, Texas Hold 'Em, Spades, and Bridge stand out) with online play was genuinely notable. Easy to pick up and play, and nice touches like the music and achievements.

4/5
* Clubhouse Games: 51 Worldwide Classics
A well polished collection of games that are not worth your time. (War, but no Hearts, Spades, or Bridge?)

2/5
* Control
While its sense of humor is appreciated and the "launch" telekinetic power (think Half-Life 2's gravity gun, minus the gun) is a treat, Control's story loses its luster once it becomes obvious that there isn't actually anything grand going on, it's just basically [[https://en.wikipedia.org/wiki/SCP_Foundation][SCP Foundation]] vignettes. Overstays its welcome with the story expansions.

3/5
* Crackdown
On the one hand, it's basically a superhuman open world playground with powerful abilities, weapons, and vehicles. On the other, the actual missions suffer when the optimal approach changes from heist-like planning to jumping around, killing everyone, and hiding when your shields wear off. That playground is pretty great, though.

4/5
* Cruelty Squad
It's a very simple throw back immersive sim. There's also a presentation that is about as abrasive as an earnest game can be, and I can't say that approach resonated with me. Gimme an Arkane game.

3/5
* Crypt of the NecroDancer
It's a cute gimmick to have a musical/turn-based roguelike, but it requires more time to git gud than I have as an adult when losing is not fun.

3/5
* Crysis
The open map and powers are great for replay, and it still looks good enough to impress, especially the second level. I'm feeling old as I remember getting my first GPU that could run this: a GTX 260 216 core. And I played on a 1680x1050 monitor. On Windows Vista.

4/5
* Crysis Warhead
More /Crysis/ fun.

4/5
* Dark Souls
Punishing, but amenable to a variety of different approaches. Frustrating, but the difficulty is overrated. Janky, but turning the jank back on your enemies feels good. Rough, but worthwhile.

4/5
* Dead Cells
It's put together well, it has a good amount of content, it's a satisfying combination of adrenaline and endorphins. But you die so quickly that I lost interest after beating the base difficulty.

3/5
* Deathloop
Arkane took notes on why I was perennially let down by the /Dishonored/ franchise. The timeloop setup, a lack of penalties for killing, bodies disintegrating upon death, and no quicksave option make for a playground that actually encourages the player to take full advantage of its systems and roll with it when it hits the fan. I have plenty of nits to pick, but I was fully hooked for its 20-hour runtime and enjoyed tinkering with my powers and loadout for each mission. Important notes: I played several months after launch, when the AI had been improved, disables online invasions, and turned off objective markers, only using them when stuck.

5/5
