_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-org78a2e8a" class="outline-2">
<h2 id="org78a2e8a">Cadence of Hyrule</h2>
<div class="outline-text-2" id="text-org78a2e8a">
<p>
A delightful bite-sized mashup of <i>Crypt of the NecroDancer</i> and <i>The Legend of Zelda</i>.
Very accessible, to the point of being a little easy even as someone who&rsquo;s terrible at <i>NecroDancer</i>, but doesn&rsquo;t overstay its welcome.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org4cfa2d3" class="outline-2">
<h2 id="org4cfa2d3">Call of Duty 4: Modern Warfare</h2>
<div class="outline-text-2" id="text-org4cfa2d3">
<p>
How spoiled we were in 2007 to have had this and <i>Halo 3</i> drop within a few weeks of each other. The campaign was unrelenting action, filled with set pieces and levels; <a href="https://en.wikipedia.org/wiki/All_Ghillied_Up">&ldquo;All Ghillied Up&rdquo;</a> has its own Wikipedia page, for crying out loud. The multiplayer took that relentlessness even further with its fast time-to-kill, and it was a masterclass in player engagement. Before the industry switched over to Skinner boxes and pay-to-win monetization, <i>COD4</i> had a constant drip of weapons and challenges, with the hamster wheel prestige system. Everything was done to excite our monkey brains, especially that little crosshair that would come up when hitting an opponent. This was a game that felt <i>good</i> to play.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgcc5efc0" class="outline-2">
<h2 id="orgcc5efc0">Cassette Beasts</h2>
<div class="outline-text-2" id="text-orgcc5efc0">
<p>
Shows how much Pokémon is held down by being Pokémon. Flexible builds, adjustable difficulty, and gameplay beyond using super effective moves. Simple story, but more interesting and tender than simply being the very best.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org6044b98" class="outline-2">
<h2 id="org6044b98">Castle Crashers</h2>
<div class="outline-text-2" id="text-org6044b98">
<p>
Casual beat &rsquo;em up simple enough for easy coop but with enough characters and gear to keep it interesting.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org15d1996" class="outline-2">
<h2 id="org15d1996">Castle of Illusion Starring Mickey Mouse</h2>
<div class="outline-text-2" id="text-org15d1996">
<p>
Once upon a time, licensed platformers were everywhere, and back in the late 80s and early 90s, many weren&rsquo;t half-bad. <i>Castle of Illusion</i> stands out thanks to its all-over-the-place level themes and enjoyable bounce-based platforming, a core revisited later by games like <i>Shovel Knight</i>.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org94fdd9a" class="outline-2">
<h2 id="org94fdd9a">Catherine: Full Body</h2>
<div class="outline-text-2" id="text-org94fdd9a">
<p>
There&rsquo;s the devious puzzle game half, with many a fist pump after a completed level. But this is Atlus, so there&rsquo;s also a fascinating and messy dating simulator half. I love many of the mature themes of love and adulthood, the art design, and Shoji Meguro&rsquo;s score filled with classical-inspired pieces. Certain aspects of the characters and their relationships are lacking, the LGBT themes are, at my most charitable, clumsily handled, and the final act(s) can go off the rails in terms of narrative and tone. Still, this is a crafted experience, and something I want to see more of in the medium.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org4daa1aa" class="outline-2">
<h2 id="org4daa1aa">Cave Story+</h2>
<div class="outline-text-2" id="text-org4daa1aa">
<p>
The original indie labor of love that paved the way for so many others. The tight movement/combat is enough, but it&rsquo;s a charming story and a truly outstanding score (I prefer the original compositions over the remixes, but the graphical updates are an improvement).
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgc623ac2" class="outline-2">
<h2 id="orgc623ac2">Celeste</h2>
<div class="outline-text-2" id="text-orgc623ac2">
<p>
The absolute best 2D platforming has to offer. Tough as nails, but never frustrating thanks to quick respawns and per-screen checkpoints. Beautifully integrates a touching story with its gameplay.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgcf06dac" class="outline-2">
<h2 id="orgcf06dac">Clubhouse Games</h2>
<div class="outline-text-2" id="text-orgcf06dac">
<p>
At the time, a collection of perfectly cromulent games, especially on the cards front (Spit, Hearts, President, Texas Hold &rsquo;Em, Spades, and Bridge stand out) with online play was genuinely notable. Easy to pick up and play, and nice touches like the music and achievements.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgf0e4204" class="outline-2">
<h2 id="orgf0e4204">Clubhouse Games: 51 Worldwide Classics</h2>
<div class="outline-text-2" id="text-orgf0e4204">
<p>
A well polished collection of games that are not worth your time. (War, but no Hearts, Spades, or Bridge?)
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org053efa6" class="outline-2">
<h2 id="org053efa6">Control</h2>
<div class="outline-text-2" id="text-org053efa6">
<p>
While its sense of humor is appreciated and the &ldquo;launch&rdquo; telekinetic power (think Half-Life 2&rsquo;s gravity gun, minus the gun) is a treat, Control&rsquo;s story loses its luster once it becomes obvious that there isn&rsquo;t actually anything grand going on, it&rsquo;s just basically <a href="https://en.wikipedia.org/wiki/SCP_Foundation">SCP Foundation</a> vignettes. Overstays its welcome with the story expansions.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org8ba5aba" class="outline-2">
<h2 id="org8ba5aba">Crackdown</h2>
<div class="outline-text-2" id="text-org8ba5aba">
<p>
On the one hand, it&rsquo;s basically a superhuman open world playground with powerful abilities, weapons, and vehicles. On the other, the actual missions suffer when the optimal approach changes from heist-like planning to jumping around, killing everyone, and hiding when your shields wear off. That playground is pretty great, though.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org98f524a" class="outline-2">
<h2 id="org98f524a">Cruelty Squad</h2>
<div class="outline-text-2" id="text-org98f524a">
<p>
It&rsquo;s a very simple throw back immersive sim. There&rsquo;s also a presentation that is about as abrasive as an earnest game can be, and I can&rsquo;t say that approach resonated with me. Gimme an Arkane game.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org3e3b9dc" class="outline-2">
<h2 id="org3e3b9dc">Crypt of the NecroDancer</h2>
<div class="outline-text-2" id="text-org3e3b9dc">
<p>
It&rsquo;s a cute gimmick to have a musical/turn-based roguelike, but it requires more time to git gud than I have as an adult when losing is not fun.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgfc14a1b" class="outline-2">
<h2 id="orgfc14a1b">Crysis</h2>
<div class="outline-text-2" id="text-orgfc14a1b">
<p>
The open map and powers are great for replay, and it still looks good enough to impress, especially the second level. I&rsquo;m feeling old as I remember getting my first GPU that could run this: a GTX 260 216 core. And I played on a 1680x1050 monitor. On Windows Vista.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgb9d7040" class="outline-2">
<h2 id="orgb9d7040">Crysis Warhead</h2>
<div class="outline-text-2" id="text-orgb9d7040">
<p>
More <i>Crysis</i> fun.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org25d3d54" class="outline-2">
<h2 id="org25d3d54">Dark Souls</h2>
<div class="outline-text-2" id="text-org25d3d54">
<p>
Punishing, but amenable to a variety of different approaches. Frustrating, but the difficulty is overrated. Janky, but turning the jank back on your enemies feels good. Rough, but worthwhile.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org3a6e0c1" class="outline-2">
<h2 id="org3a6e0c1">Dead Cells</h2>
<div class="outline-text-2" id="text-org3a6e0c1">
<p>
It&rsquo;s put together well, it has a good amount of content, it&rsquo;s a satisfying combination of adrenaline and endorphins. But you die so quickly that I lost interest after beating the base difficulty.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org743e5b6" class="outline-2">
<h2 id="org743e5b6">Deathloop</h2>
<div class="outline-text-2" id="text-org743e5b6">
<p>
Arkane took notes on why I was perennially let down by the <i>Dishonored</i> franchise. The timeloop setup, a lack of penalties for killing, bodies disintegrating upon death, and no quicksave option make for a playground that actually encourages the player to take full advantage of its systems and roll with it when it hits the fan. I have plenty of nits to pick, but I was fully hooked for its 20-hour runtime and enjoyed tinkering with my powers and loadout for each mission. Important notes: I played several months after launch, when the AI had been improved, disables online invasions, and turned off objective markers, only using them when stuck.
</p>

<p>
5/5
</p>
</div>
</div>
