org/2021-09-25-video-game-reviews.org
* Demon's Souls
A worse version of /Dark Souls/, especially with the lack of the bonfire system. An egregious incident that stands out is backing away from a dangerous enemy to heal, only to exit lock-on range and have my character turn around and die instantly to a ranged attack I would have blocked with my shield just moments ago. "That's /Souls/ games for you!" someone on the Internet gleefully exclaims. But with a job and other games to play I find that I, much like Mr. Bond, have no time to die. I'll note that the key difference between this and the other FromSoftware game I bounced off of, /Sekiro/, is that I made real progress in /Demon's Souls/ and could have beaten it if I wanted to spend the time, but the time lost due to unfair deaths wasn't worth it, while in /Sekiro/ I was incapable of getting any further when I decided very early on that it wasn't for me.

3/5
* Deus Ex: Human Revolution
Other than the forced boss fights, it's an enjoyable crawling-through-vents simulator.

4/5
* Diablo III
Watch numbers get bigger and letters hopefully get golder: the dopamine hit: the game.

3/5
* Dicey Dungeons
The dice-based mechanics just aren't that satisfying digitally. The chiptunes soundtrack bumps, but otherwise, I'd enjoy this more as a board game.

3/5
* Disco Elysium
It's a nuanced, human examination of society and the people within it. Makes BioShock's takedown of Ayn Rand look like a Reddit comment in comparison. Powerful, clever, and funny in equal parts. Takes full advantage of the CRPG genre.

5/5
* Dishonored
Same as /Dishonored 2/, but with worse level design and a painfully obvious plot twist.

3/5
* Dishonored 2
I want to love it for the imaginative level design and powers, but the game doesn't want me to love it. There are two main issues. First, most of the game's powers are novel ways to kill, but the game's morality system will tell you how awful you are if you avail yourself of them. Second, the mana system encourages the player to use their powers sparingly. (Incentives matter, people.) The result was crouching through the world, teleporting, waiting for the mana to recharge from that teleport, and repeating, quickloading whenever I was caught. This is a boring, slow way to play that the game encourages, rather than playing up its strengths.

3/5
* Dishonored: Death of the Outsider
This really should be worse than /Dishonored 2/, but the ability to kill without consequence and the recharging mana system make the minute-to-minute gameplay so much better than its immediate predecessor.

4/5
* Divinity: Original Sin 2
A stunning CRPG when it gets out of its own way. Act I especially is the best RPG experience I've had outside of [[https://en.wikipedia.org/wiki/PrinceCon][PrinceCon]]. Occasionally inconsistent difficulty and a slow final act can't take that away.

5/5
* Donkey Kong Country: Tropical Freeze
Impeccable level design. I don't have as much patience for long segments with sparse checkpoints that I did when I was a kid, though.

4/5
* DOOM (2016)
The original, perfected. Fast, relentless, and demanding. It's an adrenaline rush at Ultra-Violence, and I always felt appropriately challenged. Also one of the most well optimized games I've ever played.

5/5
* DOOM: Eternal
Suffers very hard from a need to be bigger than its predecessor. Too many interconnecting systems and actions create an overwhelming game with exactly one way to play. I had a much better time dropping the difficulty from Ultra-Violence to Hurt Me Plenty and ignoring much of it. And why is there so much platforming in a game about murdering demons as ruthlessly as possible?

4/5
* Door Kickers
I prefer to play as a real-time with pause game, but the game is intended for you to iterate on a master plan, which isn't as interesting to me, as it's more trial and error.

4/5
* Dragon Age: Origins
Wow, and this wasn't even BioWare's main dev team. An accessible entry into CRPG real-time-with-pause games from BioWare's golden age.

4/5
* Elden Ring
For the first few areas, this was my favorite open world experience since /BOTW/. Everything is appropriate for your level and there are all sorts of new discoveries and fun rewards to be found. Unfortunately, balance and fun go out the window in the mid-late game, and this is a very long game. Summons and enormously variable player levels towards the end mean that enemies are rarely of an appropriate difficulty, either getting steamrolled or killing you with a few quick hits. Quality of life problems like the interface, controls, inability to pause, and a 60 FPS cap are completely unacceptable at this point. Ultimately, the /BOTW/-meets-/Dark Souls/ idea is better on paper than in practice, and I wish this were a much tighter package.

4/5
* Elite Beat Agents
I am unsurprised that a handheld touch-based rhythm game with a nonsensical comic book story about secret agent cheerleaders helping everyday people score dates, defeat monsters, and save Christmas set to a licensed soundtrack of covers sold so poorly. But for those who enjoy the camp, it's a fun rhythm novelty. The spinners destroyed my DS' touch screen. Reminds me of the mini games in the original /Mario Party/ that destroyed joysticks and palms. Nintendo should just never have rotation mechanics, I guess.

4/5
* Enter the Gungeon
It's...fine. Just not good enough where I'd want to play it over other games. Bullet hell, mildly interesting guns, enemies, and bosses, but not the dazzling amount of content like /Isaac/ or the speed of /Dead Cells./

3/5
* Excitebike
Is this it? Cute for about 15 minutes.

2/5
* Excite Truck
The sense of speed was excellent, and it made zipping through trees without crashing a genuine thrill. But it's still a one-trick poiny. Why didn't more Wii games allow playing music off of an SD card?

3/5
* Fallout 3
Anything it wanted to do was done better by the originals or /New Vegas/.

3/5
