_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-org8cc91c9" class="outline-2">
<h2 id="org8cc91c9">Demon&rsquo;s Souls</h2>
<div class="outline-text-2" id="text-org8cc91c9">
<p>
A worse version of <i>Dark Souls</i>, especially with the lack of the bonfire system. An egregious incident that stands out is backing away from a dangerous enemy to heal, only to exit lock-on range and have my character turn around and die instantly to a ranged attack I would have blocked with my shield just moments ago. &ldquo;That&rsquo;s <i>Souls</i> games for you!&rdquo; someone on the Internet gleefully exclaims. But with a job and other games to play I find that I, much like Mr. Bond, have no time to die. I&rsquo;ll note that the key difference between this and the other FromSoftware game I bounced off of, <i>Sekiro</i>, is that I made real progress in <i>Demon&rsquo;s Souls</i> and could have beaten it if I wanted to spend the time, but the time lost due to unfair deaths wasn&rsquo;t worth it, while in <i>Sekiro</i> I was incapable of getting any further when I decided very early on that it wasn&rsquo;t for me.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org394f052" class="outline-2">
<h2 id="org394f052">Deus Ex: Human Revolution</h2>
<div class="outline-text-2" id="text-org394f052">
<p>
Other than the forced boss fights, it&rsquo;s an enjoyable crawling-through-vents simulator.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org2b21fa0" class="outline-2">
<h2 id="org2b21fa0">Diablo III</h2>
<div class="outline-text-2" id="text-org2b21fa0">
<p>
Watch numbers get bigger and letters hopefully get golder: the dopamine hit: the game.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgc5e4050" class="outline-2">
<h2 id="orgc5e4050">Dicey Dungeons</h2>
<div class="outline-text-2" id="text-orgc5e4050">
<p>
The dice-based mechanics just aren&rsquo;t that satisfying digitally. The chiptunes soundtrack bumps, but otherwise, I&rsquo;d enjoy this more as a board game.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgf72be61" class="outline-2">
<h2 id="orgf72be61">Disco Elysium</h2>
<div class="outline-text-2" id="text-orgf72be61">
<p>
It&rsquo;s a nuanced, human examination of society and the people within it. Makes BioShock&rsquo;s takedown of Ayn Rand look like a Reddit comment in comparison. Powerful, clever, and funny in equal parts. Takes full advantage of the CRPG genre.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orge5e6659" class="outline-2">
<h2 id="orge5e6659">Dishonored</h2>
<div class="outline-text-2" id="text-orge5e6659">
<p>
Same as <i>Dishonored 2</i>, but with worse level design and a painfully obvious plot twist.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org7d23cb7" class="outline-2">
<h2 id="org7d23cb7">Dishonored 2</h2>
<div class="outline-text-2" id="text-org7d23cb7">
<p>
I want to love it for the imaginative level design and powers, but the game doesn&rsquo;t want me to love it. There are two main issues. First, most of the game&rsquo;s powers are novel ways to kill, but the game&rsquo;s morality system will tell you how awful you are if you avail yourself of them. Second, the mana system encourages the player to use their powers sparingly. (Incentives matter, people.) The result was crouching through the world, teleporting, waiting for the mana to recharge from that teleport, and repeating, quickloading whenever I was caught. This is a boring, slow way to play that the game encourages, rather than playing up its strengths.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org2ae50d3" class="outline-2">
<h2 id="org2ae50d3">Dishonored: Death of the Outsider</h2>
<div class="outline-text-2" id="text-org2ae50d3">
<p>
This really should be worse than <i>Dishonored 2</i>, but the ability to kill without consequence and the recharging mana system make the minute-to-minute gameplay so much better than its immediate predecessor.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org1376321" class="outline-2">
<h2 id="org1376321">Divinity: Original Sin 2</h2>
<div class="outline-text-2" id="text-org1376321">
<p>
A stunning CRPG when it gets out of its own way. Act I especially is the best RPG experience I&rsquo;ve had outside of <a href="https://en.wikipedia.org/wiki/PrinceCon">PrinceCon</a>. Occasionally inconsistent difficulty and a slow final act can&rsquo;t take that away.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org02465c8" class="outline-2">
<h2 id="org02465c8">Donkey Kong Country: Tropical Freeze</h2>
<div class="outline-text-2" id="text-org02465c8">
<p>
Impeccable level design. I don&rsquo;t have as much patience for long segments with sparse checkpoints that I did when I was a kid, though.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org020e260" class="outline-2">
<h2 id="org020e260">DOOM (2016)</h2>
<div class="outline-text-2" id="text-org020e260">
<p>
The original, perfected. Fast, relentless, and demanding. It&rsquo;s an adrenaline rush at Ultra-Violence, and I always felt appropriately challenged. Also one of the most well optimized games I&rsquo;ve ever played.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org74f2585" class="outline-2">
<h2 id="org74f2585">DOOM: Eternal</h2>
<div class="outline-text-2" id="text-org74f2585">
<p>
Suffers very hard from a need to be bigger than its predecessor. Too many interconnecting systems and actions create an overwhelming game with exactly one way to play. I had a much better time dropping the difficulty from Ultra-Violence to Hurt Me Plenty and ignoring much of it. And why is there so much platforming in a game about murdering demons as ruthlessly as possible?
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org8841af9" class="outline-2">
<h2 id="org8841af9">Door Kickers</h2>
<div class="outline-text-2" id="text-org8841af9">
<p>
I prefer to play as a real-time with pause game, but the game is intended for you to iterate on a master plan, which isn&rsquo;t as interesting to me, as it&rsquo;s more trial and error.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgab0dfad" class="outline-2">
<h2 id="orgab0dfad">Dragon Age: Origins</h2>
<div class="outline-text-2" id="text-orgab0dfad">
<p>
Wow, and this wasn&rsquo;t even BioWare&rsquo;s main dev team. An accessible entry into CRPG real-time-with-pause games from BioWare&rsquo;s golden age.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org6d389fe" class="outline-2">
<h2 id="org6d389fe">Elden Ring</h2>
<div class="outline-text-2" id="text-org6d389fe">
<p>
For the first few areas, this was my favorite open world experience since <i>BOTW</i>. Everything is appropriate for your level and there are all sorts of new discoveries and fun rewards to be found. Unfortunately, balance and fun go out the window in the mid-late game, and this is a very long game. Summons and enormously variable player levels towards the end mean that enemies are rarely of an appropriate difficulty, either getting steamrolled or killing you with a few quick hits. Quality of life problems like the interface, controls, inability to pause, and a 60 FPS cap are completely unacceptable at this point. Ultimately, the <i>BOTW</i>-meets-<i>Dark Souls</i> idea is better on paper than in practice, and I wish this were a much tighter package.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgd0c366b" class="outline-2">
<h2 id="orgd0c366b">Elite Beat Agents</h2>
<div class="outline-text-2" id="text-orgd0c366b">
<p>
I am unsurprised that a handheld touch-based rhythm game with a nonsensical comic book story about secret agent cheerleaders helping everyday people score dates, defeat monsters, and save Christmas set to a licensed soundtrack of covers sold so poorly. But for those who enjoy the camp, it&rsquo;s a fun rhythm novelty. The spinners destroyed my DS&rsquo; touch screen. Reminds me of the mini games in the original <i>Mario Party</i> that destroyed joysticks and palms. Nintendo should just never have rotation mechanics, I guess.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org2527899" class="outline-2">
<h2 id="org2527899">Enter the Gungeon</h2>
<div class="outline-text-2" id="text-org2527899">
<p>
It&rsquo;s&#x2026;fine. Just not good enough where I&rsquo;d want to play it over other games. Bullet hell, mildly interesting guns, enemies, and bosses, but not the dazzling amount of content like <i>Isaac</i> or the speed of <i>Dead Cells.</i>
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org7c46c7b" class="outline-2">
<h2 id="org7c46c7b">Excitebike</h2>
<div class="outline-text-2" id="text-org7c46c7b">
<p>
Is this it? Cute for about 15 minutes.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org12ac612" class="outline-2">
<h2 id="org12ac612">Excite Truck</h2>
<div class="outline-text-2" id="text-org12ac612">
<p>
The sense of speed was excellent, and it made zipping through trees without crashing a genuine thrill. But it&rsquo;s still a one-trick poiny. Why didn&rsquo;t more Wii games allow playing music off of an SD card?
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org52c14a0" class="outline-2">
<h2 id="org52c14a0">Fallout 3</h2>
<div class="outline-text-2" id="text-org52c14a0">
<p>
Anything it wanted to do was done better by the originals or <i>New Vegas</i>.
</p>

<p>
3/5
</p>
</div>
</div>
