org/2021-09-25-video-game-reviews.org
* Fallout 4
Trades its RPG bona fides in for a horrifically janky FPS experience. The voiced (why!) protagonist is an idiot with no personality, and his inability to anticipate a major plot point blatantly laid possible in the first 15 minutes is frustrating. The story finishes stronger than it starts, but the only real choices are which factions you're going to murder. As a failure of both shooters and CRPGS, who is this for?

3/5
* Fallout: New Vegas
Some RPGs boast of their player freedoms. /New Vegas/ walks the walk. Pacifist? Go for it. Murder hobo? You can kill every adult human character and the game will actually acknowledge it (and I'm sure I'm not the only one to bring firearms into the Legion's camp). Wish I were in the universe where the developers had enough time to fix bugs and add all the content they wanted. Peak Bethesda jankiness.

5/5
* Fez
Suffers a bit from "/Seinfeld/ is unfunny" in that most of its fresh ideas have been copied since. Puzzles rarely fall between obtuse and facile.

3/5
* Final Fantasy VII
Gloriously imperfect. A captivating, epic JRPG that embodies the best and worst of the genre from this era. Some of Uematsu's finest scoring, a lovable crew of a cast, and the story all make for one heck of a ride. I will happily overlook the translation and graphics.

5/5
* Final Fantasy VIII
The graphical leap over /VII/ was impressive, and the soundtrack is almost as good. Shame the combat is worse and the plot goes completely off the rails in the middle of the game. This is all exacerbated by Squall being completely unlikable.

3/5
* Final Fantasy VII Remake
The highs are high, especially in the excellent closing sequence, but this makes it all the more frustrating that the game suffers from unnecessary padding and pacing issues. The presentation limits the effectiveness of its good dub with disconnects between the lines and animation, and characters often don't feel like they're talking to each other. Playable /Advent Children/ is great and all, and the characters are so much more expressive with voices and more polygons than I can count on my fingers alone, but I look at /Persona 5 Strikers/ and think of what could have been.

4/5
* Final Fantasy VII Remake Episode INTERmission
Yuffie is vibrant, /FFVIIR/'s combat isn't fun enough to make this side story worthwhile, and this is one of the worst named games I have ever encountered.

3/5
* Fire Emblem: Awakening
At release, I was blinded by the graphical upgrade from the Tellius games (and the overworld sprites of the 3DS games remain the best in the series). But the difficulty is utterly broken and encourages low-manning a handful of super units and the story is a lowlight.

3/5
* Fire Emblem Echoes: Shadows of Valentia
The series' black sheep is surprisingly excellent in its 3DS reimagining, featuring strong characterization (when the game bothers) and some real tactical challenge. The turnwheel to rewind is a fantastic quality-of-life addition for a series that needs them.

4/5

* Fire Emblem Engage
The core gameplay is strong, and the highest difficulty is one of the more balanced ones in the series (but still begs to be cheesed in the last few chapters, as is tradition). Surrounded by a baffling amount of faffing about that should have been eliminated or replaced with menus. Story starts out as the worst in the series and finishes as merely terrible.

4/5
* Fire Emblem: Fates (Birthright/Conquest/Revelation)
/Conquest/ is the gem here, and a few of its chapters, notably 10 on Hard and then Lunatic, are among my favorite in the entire series. Massive cast and replayability across the games, but /Birthright/ and /Revelation/ can be played on autopilot even at the highest difficulty, while /Conquest/ gets unfair on Lunatic at its end (and is merely punishing on Hard mode). The writing is seriously abysmal, and Corrin is the blandest insert imaginable.

2/5, 4/5, 2/5
* Fire Emblem: Path of Radiance
My introduction to the series, and still my favorite. A genuinely engaging story that stands on its own while setting up its sequel. Varied level design as well. Unit balance is poor, with Laguz being useless and paladins being grossly overpowered, and enemy phases are much too slow. But it's the writing that sets it apart. Characters all get time to exist as more than a set of stats with an equipped weapon, and the localization team actually made a character speak in iambic pentameter, which is a pretty bonkers amount of effort.

5/5
* Fire Emblem: Radiant Dawn
Characterization is almost nonexistent, and the story does get a little too epic, but it's still engaging for its long runtime, and bringing in units from /Path of Radiance/ is great. Difficulty is uneven, but it's a plus entry.

4/5
* Fire Emblem: Shadow Dragon
What if we took a character-driven RPG and removed all of the characterization? (OK, the original didn't have much there either, but all /Fire Emblem/ games must be compared to /Path of Radiance/ so that they might be criticized for how they are not /Path of Radiance/.) Make sure that the graphics are soulless and the soundtrack is grating, too.

2/5
* Fire Emblem: The Blazing Blade
Do not lock the modes with any semblance of difficulty behind completion of the easy ones. Maybe the hard modes are great, but I'm not going to replay everything to find out. Mediocre GBA /Fire Emblem/.

3/5
* Fire Emblem: The Sacred Stones
Other than the route split, it doesn't do anything worth remembering.

3/5
* Fire Emblem: Three Houses
The school setting allows the player time and reason to actually care about the characters, which makes the inevitable conflict that much more emotionally weighty, so credit there. Mostly too easy to be interesting, except when the difficulty spikes and it's too frustrating to be fun. Would probably earn a star back if it weren't for all routes sharing the same missions prior to the timeskip, and the general lack of respect the game has for the player's time in its non-battle portions.

3/5
* Frog Detective 1: The Haunted Island
I laughed once and chuckled several times, but there is almost nothing here--it took about 30 minutes and no thought to get to the credits. Just watch an episode of a good sitcom, you'll get more laughs and better pacing.

2/5
