_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-org1b2b79b" class="outline-2">
<h2 id="org1b2b79b">Fallout 4</h2>
<div class="outline-text-2" id="text-org1b2b79b">
<p>
Trades its RPG bona fides in for a horrifically janky FPS experience. The voiced (why!) protagonist is an idiot with no personality, and his inability to anticipate a major plot point blatantly laid possible in the first 15 minutes is frustrating. The story finishes stronger than it starts, but the only real choices are which factions you&rsquo;re going to murder. As a failure of both shooters and CRPGS, who is this for?
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org99fd143" class="outline-2">
<h2 id="org99fd143">Fallout: New Vegas</h2>
<div class="outline-text-2" id="text-org99fd143">
<p>
Some RPGs boast of their player freedoms. <i>New Vegas</i> walks the walk. Pacifist? Go for it. Murder hobo? You can kill every adult human character and the game will actually acknowledge it (and I&rsquo;m sure I&rsquo;m not the only one to bring firearms into the Legion&rsquo;s camp). Wish I were in the universe where the developers had enough time to fix bugs and add all the content they wanted. Peak Bethesda jankiness.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org39f867a" class="outline-2">
<h2 id="org39f867a">Fez</h2>
<div class="outline-text-2" id="text-org39f867a">
<p>
Suffers a bit from &ldquo;<i>Seinfeld</i> is unfunny&rdquo; in that most of its fresh ideas have been copied since. Puzzles rarely fall between obtuse and facile.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org24a5f38" class="outline-2">
<h2 id="org24a5f38">Final Fantasy VII</h2>
<div class="outline-text-2" id="text-org24a5f38">
<p>
Gloriously imperfect. A captivating, epic JRPG that embodies the best and worst of the genre from this era. Some of Uematsu&rsquo;s finest scoring, a lovable crew of a cast, and the story all make for one heck of a ride. I will happily overlook the translation and graphics.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org5409f0f" class="outline-2">
<h2 id="org5409f0f">Final Fantasy VIII</h2>
<div class="outline-text-2" id="text-org5409f0f">
<p>
The graphical leap over <i>VII</i> was impressive, and the soundtrack is almost as good. Shame the combat is worse and the plot goes completely off the rails in the middle of the game. This is all exacerbated by Squall being completely unlikable.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgb1cac82" class="outline-2">
<h2 id="orgb1cac82">Final Fantasy VII Remake</h2>
<div class="outline-text-2" id="text-orgb1cac82">
<p>
The highs are high, especially in the excellent closing sequence, but this makes it all the more frustrating that the game suffers from unnecessary padding and pacing issues. The presentation limits the effectiveness of its good dub with disconnects between the lines and animation, and characters often don&rsquo;t feel like they&rsquo;re talking to each other. Playable <i>Advent Children</i> is great and all, and the characters are so much more expressive with voices and more polygons than I can count on my fingers alone, but I look at <i>Persona 5 Strikers</i> and think of what could have been.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgc7249b1" class="outline-2">
<h2 id="orgc7249b1">Final Fantasy VII Remake Episode INTERmission</h2>
<div class="outline-text-2" id="text-orgc7249b1">
<p>
Yuffie is vibrant, <i>FFVIIR</i>&rsquo;s combat isn&rsquo;t fun enough to make this side story worthwhile, and this is one of the worst named games I have ever encountered.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgb056b99" class="outline-2">
<h2 id="orgb056b99">Fire Emblem: Awakening</h2>
<div class="outline-text-2" id="text-orgb056b99">
<p>
At release, I was blinded by the graphical upgrade from the Tellius games (and the overworld sprites of the 3DS games remain the best in the series). But the difficulty is utterly broken and encourages low-manning a handful of super units and the story is a lowlight.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org6a37d49" class="outline-2">
<h2 id="org6a37d49">Fire Emblem Echoes: Shadows of Valentia</h2>
<div class="outline-text-2" id="text-org6a37d49">
<p>
The series&rsquo; black sheep is surprisingly excellent in its 3DS reimagining, featuring strong characterization (when the game bothers) and some real tactical challenge. The turnwheel to rewind is a fantastic quality-of-life addition for a series that needs them.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org5d43563" class="outline-2">
<h2 id="org5d43563">Fire Emblem Engage</h2>
<div class="outline-text-2" id="text-org5d43563">
<p>
The core gameplay is strong, and the highest difficulty is one of the more balanced ones in the series (but still begs to be cheesed in the last few chapters, as is tradition). Surrounded by a baffling amount of faffing about that should have been eliminated or replaced with menus. Story starts out as the worst in the series and finishes as merely terrible.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org2a39abe" class="outline-2">
<h2 id="org2a39abe">Fire Emblem: Fates (Birthright/Conquest/Revelation)</h2>
<div class="outline-text-2" id="text-org2a39abe">
<p>
<i>Conquest</i> is the gem here, and a few of its chapters, notably 10 on Hard and then Lunatic, are among my favorite in the entire series. Massive cast and replayability across the games, but <i>Birthright</i> and <i>Revelation</i> can be played on autopilot even at the highest difficulty, while <i>Conquest</i> gets unfair on Lunatic at its end (and is merely punishing on Hard mode). The writing is seriously abysmal, and Corrin is the blandest insert imaginable.
</p>

<p>
2/5, 4/5, 2/5
</p>
</div>
</div>
<div id="outline-container-org99a537f" class="outline-2">
<h2 id="org99a537f">Fire Emblem: Path of Radiance</h2>
<div class="outline-text-2" id="text-org99a537f">
<p>
My introduction to the series, and still my favorite. A genuinely engaging story that stands on its own while setting up its sequel. Varied level design as well. Unit balance is poor, with Laguz being useless and paladins being grossly overpowered, and enemy phases are much too slow. But it&rsquo;s the writing that sets it apart. Characters all get time to exist as more than a set of stats with an equipped weapon, and the localization team actually made a character speak in iambic pentameter, which is a pretty bonkers amount of effort.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org8206aeb" class="outline-2">
<h2 id="org8206aeb">Fire Emblem: Radiant Dawn</h2>
<div class="outline-text-2" id="text-org8206aeb">
<p>
Characterization is almost nonexistent, and the story does get a little too epic, but it&rsquo;s still engaging for its long runtime, and bringing in units from <i>Path of Radiance</i> is great. Difficulty is uneven, but it&rsquo;s a plus entry.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org4d202dc" class="outline-2">
<h2 id="org4d202dc">Fire Emblem: Shadow Dragon</h2>
<div class="outline-text-2" id="text-org4d202dc">
<p>
What if we took a character-driven RPG and removed all of the characterization? (OK, the original didn&rsquo;t have much there either, but all <i>Fire Emblem</i> games must be compared to <i>Path of Radiance</i> so that they might be criticized for how they are not <i>Path of Radiance</i>.) Make sure that the graphics are soulless and the soundtrack is grating, too.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-orgdccfa35" class="outline-2">
<h2 id="orgdccfa35">Fire Emblem: The Blazing Blade</h2>
<div class="outline-text-2" id="text-orgdccfa35">
<p>
Do not lock the modes with any semblance of difficulty behind completion of the easy ones. Maybe the hard modes are great, but I&rsquo;m not going to replay everything to find out. Mediocre GBA <i>Fire Emblem</i>.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org5e3bd66" class="outline-2">
<h2 id="org5e3bd66">Fire Emblem: The Sacred Stones</h2>
<div class="outline-text-2" id="text-org5e3bd66">
<p>
Other than the route split, it doesn&rsquo;t do anything worth remembering.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org0d4b0e6" class="outline-2">
<h2 id="org0d4b0e6">Fire Emblem: Three Houses</h2>
<div class="outline-text-2" id="text-org0d4b0e6">
<p>
The school setting allows the player time and reason to actually care about the characters, which makes the inevitable conflict that much more emotionally weighty, so credit there. Mostly too easy to be interesting, except when the difficulty spikes and it&rsquo;s too frustrating to be fun. Would probably earn a star back if it weren&rsquo;t for all routes sharing the same missions prior to the timeskip, and the general lack of respect the game has for the player&rsquo;s time in its non-battle portions.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orga51988a" class="outline-2">
<h2 id="orga51988a">Frog Detective 1: The Haunted Island</h2>
<div class="outline-text-2" id="text-orga51988a">
<p>
I laughed once and chuckled several times, but there is almost nothing here&#x2013;it took about 30 minutes and no thought to get to the credits. Just watch an episode of a good sitcom, you&rsquo;ll get more laughs and better pacing.
</p>

<p>
2/5
</p>
</div>
</div>
