org/2021-09-25-video-game-reviews.org
* Frog Detective 2: The Case of the Invisible Wizard
Charming, amusing, and inoffensive.

3/5
* Frog Detective 3: Corruption at Cowboy County
The zenith of the series.

3/5
* FTL: Faster Than Light
A model for modern roguelikes with good reason. Many paths to victory, though within each archetype, things sometimes feel samey. Good variety of weapons, ships, and crew. Individual runs are a tad long, with too much of each run being navigating text boxes.

4/5
* F-Zero GX
I don't even like racing games and this one is still perfect. Not as hard as I remember it being as a kid, and I had a blast beating all the cups and missions as an adult. How did they get a Gamecube game to look this good at an unflappable 60 FPS? Don't blink and drive.

5/5
* Gears Tactics
A clone of the modern XCOM games. What it does better: encouraging a fast/aggressive playstyle and the overwatch system. What it does worse: repetitive side missions to pad its short length (this is a 10 hour game padded to more than 20, as of this writing I'm ambivalent as to whether it's worth another mind-numbing dozen side missions to play the remaining seven story levels), nonexistent strategic layer, slow experience growth, constantly replacing non-hero units with new recruits who come at higher levels, and being too easy (I played at the second-highest difficulty). But it's recognizably XCOM, and that's a good core, even if I don't bother coming back to it.

4/5
* God of War (2005)
The beat 'em up mechanics are the best thing the original /God of War/ has to offer, but they're shallow and repetitive. Everything else here, like the actively un-fun platforming, tiring puzzles, an irritating love of quick time events, and mediocre story presented poorly, bring it down further. The cinematography, voice acting, and sexism are all offensive.

2/5
* Golden Sun
Very derivative of its SNES JRPG ancestors. Amazing graphics for the system, and Sakuraba did an excellent job on the soundtrack. Too easy.

3/5
* Golden Sun: Dark Dawn
Look how they massacred my boy.

2/5
* Golden Sun: The Lost Age
It's incredible that all this fit onto the GBA. Bigger and better in almost every way from its predecessor, especially in its puzzles. Does suffer a bit from its scope, especially for those who want to collect all the Djinn (it's an old JRPG, just use a walkthrough and move on).

4/5
* Golf Story
Finally, the spiritual successor to the GBC /Mario Golf/ I've been waiting for. Constantly amusing, no more, no less.

4/5
* Gone Home
I went in blind, and remember everything of the experience. I'm sure it would feel dated or supplanted if I were to go back, but it's the kind of perspective and emotion more games need.

5/5
* Grand Theft Auto: Chinatown Wars
By embracing the limitations of the DS, Rockstar's odd combination of touch mechanics and throwback top-down gameplay hits all the right notes. Driving especially is arcadey joy. In the series' storied mistreatment of women, not enough attention is paid to /Chinatown Wars/ creating a female character so they could put her on the cover, then killing her off immediately.

5/5
* Grand Theft Auto V
A stunning technical achievement of the seventh generation of consoles, but not a good game. Some of the missions, especially the heists, are fun, but there aren't enough of them in between the time killers. Trevor is not nearly the social commentary that Rockstar thinks he is. The torture scene was one of the worst experiences I have had in all of gaming, with no artistic merit.

3/5
* Guitar Hero 5
Best in the series, especially with the ability to import songs from other games. Great tracklist for all instruments. I miss the rhythm game era, but it completely oversaturated itself.

4/5
* Gunpoint
I'm a fan of the evening's entertainment indie game (see: /Gone Home/), it's interestingly written, it explores its mechanics thoroughly in its short runtime, I just don't find its moment-to-moment gameplay particularly fun.

3/5
* Gunstar Heroes
A personal favorite shmup due to its numerous weapon combinations and two characters offering plenty of different experiences.

4/5
* Hades
Beautifully woven story/gameplay interaction. While a great game, it's a roguelike for people who don't like roguelikes. And as a fan of the genre, it lacks the staying power of something like The Binding of Isaac. Would love to see an expansion to add some replayability, and the difficulty progression really could have benefited from allowing rewards for increasing the level by more than 1 at a time. I'm nitpicking because I love it.

5/5
* Half-Life 2
A masterpiece. With better lighting and lip syncing, this could come out today and still be well received. The story is simple but executed well, the writing is great, and the gameplay is outstanding. Weapons, from the shotgun to the gravity gun, are satisfying. The pacing is the real star, especially with how it shifts between long stretches of isolation and segments with allies.

5/5
* Half-Life 2: Episode 1
The weakest link in the /Half-Life 2/ series is still a good game, but the focus on urban combat isn't as interesting as what the others offer.

4/5
* Half-Life 2: Episode 2
A literal rbeath of fresh air as the adventure leaves City 17 while retaining everything that made /Half-Life 2/ great.

5/5
* Halo 2
Makes a strong case for best campaign in the series. Imaginative settings, engaging combat that's slow enough to be tactical, and a multiplayer juggernaut.

5/5
* Halo 3
The campaign flies high and peaks with The Covenant level, offering some of the most epic setpieces in the series done justice by composer Marty O'Donnell. And its multiplayer was world-changing on consoles with its Forge mode and custom games. I have fond memories of my early teens filled with Grifball.

5/5
* Halo 3: ODST
While the concept of a /Halo/ game in an urban setting playing as non-Spartans is sound, the gratuitous emphasis on a bad story and boring objectives aren't.

3/5
