_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-org711bc75" class="outline-2">
<h2 id="org711bc75">Frog Detective 2: The Case of the Invisible Wizard</h2>
<div class="outline-text-2" id="text-org711bc75">
<p>
Charming, amusing, and inoffensive.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgac81156" class="outline-2">
<h2 id="orgac81156">Frog Detective 3: Corruption at Cowboy County</h2>
<div class="outline-text-2" id="text-orgac81156">
<p>
The zenith of the series.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org2218185" class="outline-2">
<h2 id="org2218185">FTL: Faster Than Light</h2>
<div class="outline-text-2" id="text-org2218185">
<p>
A model for modern roguelikes with good reason. Many paths to victory, though within each archetype, things sometimes feel samey. Good variety of weapons, ships, and crew. Individual runs are a tad long, with too much of each run being navigating text boxes.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org6b36ca7" class="outline-2">
<h2 id="org6b36ca7">F-Zero GX</h2>
<div class="outline-text-2" id="text-org6b36ca7">
<p>
I don&rsquo;t even like racing games and this one is still perfect. Not as hard as I remember it being as a kid, and I had a blast beating all the cups and missions as an adult. How did they get a Gamecube game to look this good at an unflappable 60 FPS? Don&rsquo;t blink and drive.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org1884472" class="outline-2">
<h2 id="org1884472">Gears Tactics</h2>
<div class="outline-text-2" id="text-org1884472">
<p>
A clone of the modern XCOM games. What it does better: encouraging a fast/aggressive playstyle and the overwatch system. What it does worse: repetitive side missions to pad its short length (this is a 10 hour game padded to more than 20, as of this writing I&rsquo;m ambivalent as to whether it&rsquo;s worth another mind-numbing dozen side missions to play the remaining seven story levels), nonexistent strategic layer, slow experience growth, constantly replacing non-hero units with new recruits who come at higher levels, and being too easy (I played at the second-highest difficulty). But it&rsquo;s recognizably XCOM, and that&rsquo;s a good core, even if I don&rsquo;t bother coming back to it.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org60e039f" class="outline-2">
<h2 id="org60e039f">God of War (2005)</h2>
<div class="outline-text-2" id="text-org60e039f">
<p>
The beat &rsquo;em up mechanics are the best thing the original <i>God of War</i> has to offer, but they&rsquo;re shallow and repetitive. Everything else here, like the actively un-fun platforming, tiring puzzles, an irritating love of quick time events, and mediocre story presented poorly, bring it down further. The cinematography, voice acting, and sexism are all offensive.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org2c4875e" class="outline-2">
<h2 id="org2c4875e">Golden Sun</h2>
<div class="outline-text-2" id="text-org2c4875e">
<p>
Very derivative of its SNES JRPG ancestors. Amazing graphics for the system, and Sakuraba did an excellent job on the soundtrack. Too easy.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org135236a" class="outline-2">
<h2 id="org135236a">Golden Sun: Dark Dawn</h2>
<div class="outline-text-2" id="text-org135236a">
<p>
Look how they massacred my boy.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-orgeaa5d99" class="outline-2">
<h2 id="orgeaa5d99">Golden Sun: The Lost Age</h2>
<div class="outline-text-2" id="text-orgeaa5d99">
<p>
It&rsquo;s incredible that all this fit onto the GBA. Bigger and better in almost every way from its predecessor, especially in its puzzles. Does suffer a bit from its scope, especially for those who want to collect all the Djinn (it&rsquo;s an old JRPG, just use a walkthrough and move on).
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org9d299bd" class="outline-2">
<h2 id="org9d299bd">Golf Story</h2>
<div class="outline-text-2" id="text-org9d299bd">
<p>
Finally, the spiritual successor to the GBC <i>Mario Golf</i> I&rsquo;ve been waiting for. Constantly amusing, no more, no less.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgd65f797" class="outline-2">
<h2 id="orgd65f797">Gone Home</h2>
<div class="outline-text-2" id="text-orgd65f797">
<p>
I went in blind, and remember everything of the experience. I&rsquo;m sure it would feel dated or supplanted if I were to go back, but it&rsquo;s the kind of perspective and emotion more games need.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org5c1fe31" class="outline-2">
<h2 id="org5c1fe31">Grand Theft Auto: Chinatown Wars</h2>
<div class="outline-text-2" id="text-org5c1fe31">
<p>
By embracing the limitations of the DS, Rockstar&rsquo;s odd combination of touch mechanics and throwback top-down gameplay hits all the right notes. Driving especially is arcadey joy. In the series&rsquo; storied mistreatment of women, not enough attention is paid to <i>Chinatown Wars</i> creating a female character so they could put her on the cover, then killing her off immediately.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org69a96b4" class="outline-2">
<h2 id="org69a96b4">Grand Theft Auto V</h2>
<div class="outline-text-2" id="text-org69a96b4">
<p>
A stunning technical achievement of the seventh generation of consoles, but not a good game. Some of the missions, especially the heists, are fun, but there aren&rsquo;t enough of them in between the time killers. Trevor is not nearly the social commentary that Rockstar thinks he is. The torture scene was one of the worst experiences I have had in all of gaming, with no artistic merit.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org3b51927" class="outline-2">
<h2 id="org3b51927">Guitar Hero 5</h2>
<div class="outline-text-2" id="text-org3b51927">
<p>
Best in the series, especially with the ability to import songs from other games. Great tracklist for all instruments. I miss the rhythm game era, but it completely oversaturated itself.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org38aa9ef" class="outline-2">
<h2 id="org38aa9ef">Gunpoint</h2>
<div class="outline-text-2" id="text-org38aa9ef">
<p>
I&rsquo;m a fan of the evening&rsquo;s entertainment indie game (see: <i>Gone Home</i>), it&rsquo;s interestingly written, it explores its mechanics thoroughly in its short runtime, I just don&rsquo;t find its moment-to-moment gameplay particularly fun.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgfcef179" class="outline-2">
<h2 id="orgfcef179">Gunstar Heroes</h2>
<div class="outline-text-2" id="text-orgfcef179">
<p>
A personal favorite shmup due to its numerous weapon combinations and two characters offering plenty of different experiences.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgb361549" class="outline-2">
<h2 id="orgb361549">Hades</h2>
<div class="outline-text-2" id="text-orgb361549">
<p>
Beautifully woven story/gameplay interaction. While a great game, it&rsquo;s a roguelike for people who don&rsquo;t like roguelikes. And as a fan of the genre, it lacks the staying power of something like The Binding of Isaac. Would love to see an expansion to add some replayability, and the difficulty progression really could have benefited from allowing rewards for increasing the level by more than 1 at a time. I&rsquo;m nitpicking because I love it.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org7a63614" class="outline-2">
<h2 id="org7a63614">Half-Life 2</h2>
<div class="outline-text-2" id="text-org7a63614">
<p>
A masterpiece. With better lighting and lip syncing, this could come out today and still be well received. The story is simple but executed well, the writing is great, and the gameplay is outstanding. Weapons, from the shotgun to the gravity gun, are satisfying. The pacing is the real star, especially with how it shifts between long stretches of isolation and segments with allies.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgdd666e4" class="outline-2">
<h2 id="orgdd666e4">Half-Life 2: Episode 1</h2>
<div class="outline-text-2" id="text-orgdd666e4">
<p>
The weakest link in the <i>Half-Life 2</i> series is still a good game, but the focus on urban combat isn&rsquo;t as interesting as what the others offer.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgf795b73" class="outline-2">
<h2 id="orgf795b73">Half-Life 2: Episode 2</h2>
<div class="outline-text-2" id="text-orgf795b73">
<p>
A literal rbeath of fresh air as the adventure leaves City 17 while retaining everything that made <i>Half-Life 2</i> great.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgec73871" class="outline-2">
<h2 id="orgec73871">Halo 2</h2>
<div class="outline-text-2" id="text-orgec73871">
<p>
Makes a strong case for best campaign in the series. Imaginative settings, engaging combat that&rsquo;s slow enough to be tactical, and a multiplayer juggernaut.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgc093348" class="outline-2">
<h2 id="orgc093348">Halo 3</h2>
<div class="outline-text-2" id="text-orgc093348">
<p>
The campaign flies high and peaks with The Covenant level, offering some of the most epic setpieces in the series done justice by composer Marty O&rsquo;Donnell. And its multiplayer was world-changing on consoles with its Forge mode and custom games. I have fond memories of my early teens filled with Grifball.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgaa3d106" class="outline-2">
<h2 id="orgaa3d106">Halo 3: ODST</h2>
<div class="outline-text-2" id="text-orgaa3d106">
<p>
While the concept of a <i>Halo</i> game in an urban setting playing as non-Spartans is sound, the gratuitous emphasis on a bad story and boring objectives aren&rsquo;t.
</p>

<p>
3/5
</p>
</div>
</div>
