org/2021-09-25-video-game-reviews.org
* Halo 4
Throws out the weapons and enemies that made Halo great. Apparently the story makes sense if you read a licensed companion novel, which I'm not doing for a /Halo/ game.

2/5
* Halo: Combat Evolved
Long levels filled with repetition and backtracking. Does not hold up. Entirely supplanted by (most of) its sequels.

2/5
* Halo: Reach
While I'm definitely not here for the story, I was shocked to find out that Bungie still had more to do with the Halo series. Excellent twists and fun new toys breathed life into the series. Take notes, /Halo 4/.

4/5
* Hi-Fi Rush
If a rhythm-based spectacle fighter sounds appealing, then this will be a treat. Has some standout moments across its boss fights and licensed songs.

4/5
* Hitman (2016)
Recaptures the sandboxy fun of /Blood Money/. Plenty of imaginative assassinations with room for your own. Rewards replays and level knowledge, which may or may not be a plus.

4/5
* Hitman 2 (2018)
More of the same /Hitman/. I appreciate the ability to import its predecessor's levels into the engine to have everything under one roof.

4/5
* Hitman 3
Still yet more of the same. Wouldn't have minded a few more missions. Credit where credit is due for continuing to import prior games' levels yet shrinking the disk space required.

4/5
* Hitman: Absolution
An unremarkable third-person action game masquerading as a /Hitman/ game. There are actually a handful of decent missions similar to /Blood Money/, but not enough to save it.

3/5
* Hitman: Blood Money
/Blood Money/ still has a lot to offer with its intricate, hand-designed levels that reward knowledge of the game's systems and the individual missions. Find a sniper perch, get the target alone and strangle them, poison their food, set up a trap, the possibilities are endless, and pulling off a plan feels darn satisfying.

4/5
* Hollow Knight
10 hours in and I was ready to award it 5/5 as a fantastically executed Metroidvania/Soulslike hybrid with superb controls and presentation. 8.5 hours later, having settled for the bad ending, I can't. I have patience for certain difficult games, such as /Celeste/ and /Super Meat Boy/, but those games almost universally feature instant retries without penalty. /Hollow Knight/ is an absolute slog towards the end, not necessarily due to the difficulty of any of its mandatory bosses (I don't think I died more than thrice on anything required), but because of the amount of downtime. Fast travel is limited, and this led to many situations of fast traveling, walking a minute to the bank, walking back, fast traveling somewhere else, buying something, walking to another vendor, finding out I needed more geo, going back to the bank... Or the situations where I die to a boss and have to redo trivial (but slow!) platforming challenges and basic baddies to get back to the boss only to die again. Or my personal favorite, the optional /Super Meat Boy/ spinning saws platformer area where your health is supposed to be a scary limitation for the platforming gauntlet, but I had equipped the charm where your last pip of damage slowly recovers, and so every death meant 30 seconds of looking at my phone instead of playing the game. These are fundamental design problems, and they're frustratingly solvable. Upon discovery that the good ending was locked behind a super boss that requires beating the normal final boss prior to every attempt, I completely lost interest. Which is a shame, because there's a phenomenal game in here.

4/5
* Horizon Zero Dawn
Starts off with a thoughtful premise and gameplay that teases a combination of /Breath of the Wild/ and /Monster Hunter/ before mostly settling into a generic modern open-world game with all of the pointless padding, jank, and ill-executed narrative that entails. Shooting robot dinosaurs with a bow is fun, and yet most of your time is spent doing tedious tasks like reading/listening to exposition (both for the impossibly uninteresting contemporary narrative and the more passable sci-fi backstory), holding forward on the developer-ordained correct path through ruins/wreckage/cliffs, fighting boring humans, and manging your inventory. Aloy's characterization is terrible, and how is someone who spent her entire childhood talking to almost no one except for JB Blanc so sarcastic?

3/5
* I Am Setsuna
Some interesting ideas for combat and story, but not enough for 20+ hours.

3/5
* ICO
A beautiful, poignant movie. As a game? Most of the puzzles are OK, but there's no reason for the combat other than to pad length.

3/5
* Inscryption
As a card game in the /Slay the Spire/ mold, it's enjoyable, but the actual card battling is very narrow tactically, with most of the fun coming from finding ways to create overpowered cards, which is deliberately encouraged by the game. As a fourth wall-breaking subversive indie horror game, nothing felt particularly novel, and I might well have enjoyed the game more if it just wanted to be another roguelike deckbuilder.

4/5
* Into the Breach
Almost pure tactics, with just enough management/strategy between to make it interesting, but not enough for greater replayability. Minor failures, like taking just one point of damage on an island and missing the bonus, don't feel good, and feedback isn't great for determining what you could have done better. Finally got its Advanced Edition update like /FTL/ before it, but that doesn't change the fundamentals.

4/5
* It Takes Two
A very competent 3D platformer adventure elevated enormously by endless imagination and tight integration of gameplay and narrative. A cooperative experience not to be missed.

5/5
* Jak 3
A bigger and better /Jak II/.

4/5
* Jak and Daxter: The Precusror Legacy
It's a great addition to the /Super Mario 64/ or /Banjo-Kazooie/-style collectathon, but it's also a technical marvel for its lack of loading screens.

4/5
* Jak II
More of an action game (suddenly we have cursing and guns, but at least the guns integrate well into the combat) than its precursor, but a great one. Tough.

4/5
* James Bond 007: Everything or Nothing
The best Bond game for understanding that first-person shooters are not the appropriate mechanism. Essentially a playable Brosnan film filled with toys and setpieces.

4/5
