_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-orgb64f9fd" class="outline-2">
<h2 id="orgb64f9fd">Halo 4</h2>
<div class="outline-text-2" id="text-orgb64f9fd">
<p>
Throws out the weapons and enemies that made Halo great. Apparently the story makes sense if you read a licensed companion novel, which I&rsquo;m not doing for a <i>Halo</i> game.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org66ac02e" class="outline-2">
<h2 id="org66ac02e">Halo: Combat Evolved</h2>
<div class="outline-text-2" id="text-org66ac02e">
<p>
Long levels filled with repetition and backtracking. Does not hold up. Entirely supplanted by (most of) its sequels.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-orga979b3a" class="outline-2">
<h2 id="orga979b3a">Halo: Reach</h2>
<div class="outline-text-2" id="text-orga979b3a">
<p>
While I&rsquo;m definitely not here for the story, I was shocked to find out that Bungie still had more to do with the Halo series. Excellent twists and fun new toys breathed life into the series. Take notes, <i>Halo 4</i>.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org9acfa58" class="outline-2">
<h2 id="org9acfa58">Hi-Fi Rush</h2>
<div class="outline-text-2" id="text-org9acfa58">
<p>
If a rhythm-based spectacle fighter sounds appealing, then this will be a treat. Has some standout moments across its boss fights and licensed songs.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgd69ab17" class="outline-2">
<h2 id="orgd69ab17">Hitman (2016)</h2>
<div class="outline-text-2" id="text-orgd69ab17">
<p>
Recaptures the sandboxy fun of <i>Blood Money</i>. Plenty of imaginative assassinations with room for your own. Rewards replays and level knowledge, which may or may not be a plus.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org26fdd67" class="outline-2">
<h2 id="org26fdd67">Hitman 2 (2018)</h2>
<div class="outline-text-2" id="text-org26fdd67">
<p>
More of the same <i>Hitman</i>. I appreciate the ability to import its predecessor&rsquo;s levels into the engine to have everything under one roof.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org22d42fb" class="outline-2">
<h2 id="org22d42fb">Hitman 3</h2>
<div class="outline-text-2" id="text-org22d42fb">
<p>
Still yet more of the same. Wouldn&rsquo;t have minded a few more missions. Credit where credit is due for continuing to import prior games&rsquo; levels yet shrinking the disk space required.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org4545cc4" class="outline-2">
<h2 id="org4545cc4">Hitman: Absolution</h2>
<div class="outline-text-2" id="text-org4545cc4">
<p>
An unremarkable third-person action game masquerading as a <i>Hitman</i> game. There are actually a handful of decent missions similar to <i>Blood Money</i>, but not enough to save it.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org8ca732c" class="outline-2">
<h2 id="org8ca732c">Hitman: Blood Money</h2>
<div class="outline-text-2" id="text-org8ca732c">
<p>
<i>Blood Money</i> still has a lot to offer with its intricate, hand-designed levels that reward knowledge of the game&rsquo;s systems and the individual missions. Find a sniper perch, get the target alone and strangle them, poison their food, set up a trap, the possibilities are endless, and pulling off a plan feels darn satisfying.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org2f9f149" class="outline-2">
<h2 id="org2f9f149">Hollow Knight</h2>
<div class="outline-text-2" id="text-org2f9f149">
<p>
10 hours in and I was ready to award it 5/5 as a fantastically executed Metroidvania/Soulslike hybrid with superb controls and presentation. 8.5 hours later, having settled for the bad ending, I can&rsquo;t. I have patience for certain difficult games, such as <i>Celeste</i> and <i>Super Meat Boy</i>, but those games almost universally feature instant retries without penalty. <i>Hollow Knight</i> is an absolute slog towards the end, not necessarily due to the difficulty of any of its mandatory bosses (I don&rsquo;t think I died more than thrice on anything required), but because of the amount of downtime. Fast travel is limited, and this led to many situations of fast traveling, walking a minute to the bank, walking back, fast traveling somewhere else, buying something, walking to another vendor, finding out I needed more geo, going back to the bank&#x2026; Or the situations where I die to a boss and have to redo trivial (but slow!) platforming challenges and basic baddies to get back to the boss only to die again. Or my personal favorite, the optional <i>Super Meat Boy</i> spinning saws platformer area where your health is supposed to be a scary limitation for the platforming gauntlet, but I had equipped the charm where your last pip of damage slowly recovers, and so every death meant 30 seconds of looking at my phone instead of playing the game. These are fundamental design problems, and they&rsquo;re frustratingly solvable. Upon discovery that the good ending was locked behind a super boss that requires beating the normal final boss prior to every attempt, I completely lost interest. Which is a shame, because there&rsquo;s a phenomenal game in here.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgcc34bb1" class="outline-2">
<h2 id="orgcc34bb1">Horizon Zero Dawn</h2>
<div class="outline-text-2" id="text-orgcc34bb1">
<p>
Starts off with a thoughtful premise and gameplay that teases a combination of <i>Breath of the Wild</i> and <i>Monster Hunter</i> before mostly settling into a generic modern open-world game with all of the pointless padding, jank, and ill-executed narrative that entails. Shooting robot dinosaurs with a bow is fun, and yet most of your time is spent doing tedious tasks like reading/listening to exposition (both for the impossibly uninteresting contemporary narrative and the more passable sci-fi backstory), holding forward on the developer-ordained correct path through ruins/wreckage/cliffs, fighting boring humans, and manging your inventory. Aloy&rsquo;s characterization is terrible, and how is someone who spent her entire childhood talking to almost no one except for JB Blanc so sarcastic?
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgb034fbd" class="outline-2">
<h2 id="orgb034fbd">I Am Setsuna</h2>
<div class="outline-text-2" id="text-orgb034fbd">
<p>
Some interesting ideas for combat and story, but not enough for 20+ hours.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orga7d1825" class="outline-2">
<h2 id="orga7d1825">ICO</h2>
<div class="outline-text-2" id="text-orga7d1825">
<p>
A beautiful, poignant movie. As a game? Most of the puzzles are OK, but there&rsquo;s no reason for the combat other than to pad length.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org4926f05" class="outline-2">
<h2 id="org4926f05">Inscryption</h2>
<div class="outline-text-2" id="text-org4926f05">
<p>
As a card game in the <i>Slay the Spire</i> mold, it&rsquo;s enjoyable, but the actual card battling is very narrow tactically, with most of the fun coming from finding ways to create overpowered cards, which is deliberately encouraged by the game. As a fourth wall-breaking subversive indie horror game, nothing felt particularly novel, and I might well have enjoyed the game more if it just wanted to be another roguelike deckbuilder.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org7c85752" class="outline-2">
<h2 id="org7c85752">Into the Breach</h2>
<div class="outline-text-2" id="text-org7c85752">
<p>
Almost pure tactics, with just enough management/strategy between to make it interesting, but not enough for greater replayability. Minor failures, like taking just one point of damage on an island and missing the bonus, don&rsquo;t feel good, and feedback isn&rsquo;t great for determining what you could have done better. Finally got its Advanced Edition update like <i>FTL</i> before it, but that doesn&rsquo;t change the fundamentals.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgece6b6a" class="outline-2">
<h2 id="orgece6b6a">It Takes Two</h2>
<div class="outline-text-2" id="text-orgece6b6a">
<p>
A very competent 3D platformer adventure elevated enormously by endless imagination and tight integration of gameplay and narrative. A cooperative experience not to be missed.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org34f82a1" class="outline-2">
<h2 id="org34f82a1">Jak 3</h2>
<div class="outline-text-2" id="text-org34f82a1">
<p>
A bigger and better <i>Jak II</i>.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgaf0fd68" class="outline-2">
<h2 id="orgaf0fd68">Jak and Daxter: The Precusror Legacy</h2>
<div class="outline-text-2" id="text-orgaf0fd68">
<p>
It&rsquo;s a great addition to the <i>Super Mario 64</i> or <i>Banjo-Kazooie</i>-style collectathon, but it&rsquo;s also a technical marvel for its lack of loading screens.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgf7f9ad9" class="outline-2">
<h2 id="orgf7f9ad9">Jak II</h2>
<div class="outline-text-2" id="text-orgf7f9ad9">
<p>
More of an action game (suddenly we have cursing and guns, but at least the guns integrate well into the combat) than its precursor, but a great one. Tough.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org63ce765" class="outline-2">
<h2 id="org63ce765">James Bond 007: Everything or Nothing</h2>
<div class="outline-text-2" id="text-org63ce765">
<p>
The best Bond game for understanding that first-person shooters are not the appropriate mechanism. Essentially a playable Brosnan film filled with toys and setpieces.
</p>

<p>
4/5
</p>
</div>
</div>
