org/2021-09-25-video-game-reviews.org
* Just Cause 2
A seminal game in the genre of open world absurdist power fantasies solely thanks to the grappling hook.

4/5
* Kerbal Space Program
Taught me more about physics than my entire formal education. I played in the Scott Manley era, before much of the structure later added, and while a bit spartan in presentation, I still remember landing on Minmus and the Mun.

4/5
* L.A. Noire
As a technical experiment, a great success. As a game, not so much. The unnecessary driving and combat are obvious concessions to the /GTA/ crowd, your interviewee's tells are all too obvious, but mostly, I'm still annoyed at when the game withholds information from you in a case, lets you fail, and chews you out for it. Compare that with when I failed as a cop in /Disco Elysium/, which brought out real emotions and feelings of inadequacy, which the game was going for.

2/5
* Luftrausers
An amusing diversion for a few hours, but I absolutely do not care for endless arcade games.

3/5
* Luigi's Mansion 3
Charming action/puzzler. Next Level Games clearly put a lot of effort into the animation, and it shows.

4/5
* Major League Baseball Featuring Ken Griffey Jr.
Surprisingly fun arcadey baseball, but there's not much to keep you coming back.

3/5
* Mario Golf (GBC)
The GBC version of /Mario Golf/ was inexplicably an RPG, and boy, does it work. The surprisingly deep golf mechanics are sound, and the RPG quest makes great use of them with a host of varied challenges in addition to more vanilla golf.

4/5
* Mario Kart 7
A mundane entry in the series, but portable online /Mario Kart/ is still an easy sell.

3/5
* Mario Kart 8 Deluxe
The standard "I dunno, what do you wanna play" when hosting and playing video games. A bit less fun solo or online, but still gorgeous and with a large variety of tracks.

4/5
* Mario Kart DS
It's a fine entry in the series, but wireless local and online multiplayer were huge. This was the first time I ever played a game online outside of my home. I was at an airport and it blew my mind. Now we live in a world where I tether my Switch to my phone while on line at a restaurant to squeeze in some /Splatoon/ and support Team Ketchup.

4/5
* Mario Party
It would be easy to be unfairly harsh on the progenitor of the modern party game, whether for its randomness, graphics, or minigames that resulted in physical pain, but it caught on for a reason. That said, if I want a social experience with a moderately sized group of people, I'm reaching for a board game. Looking at each other instead of a screen.

3/5
* Mario + Rabbids: Kingdom Battle
This game has absolutely no business being a satisfying tactical battler. The liberal movement system is a blast, and it's surprisingly tricky at times. Would be significantly better if you could take Mario out of your party.

4/5
* Mass Effect
The black sheep of the series for its clunky combat, the original Mass Effect nevertheless has the best worldbuilding and story of them all.

4/5
* Mass Effect 2
Well written, deeply emotional, and featuring actually competent gunplay. BioWare's finest outing.

5/5
* Mass Effect 3
The price of Mass Effect 2 spending its time on what amount to sidequests to develop its cast is that Mass Effect 3's story has entirely too much ground to cover. The unsatisfying ending cannot take away from the dozens of hours preceding it in video gaming's finest space epic.

4/5
* Metal Gear Solid 3D: Snake Eater
Has anyone ever tried saying no to Kojima? Certainly not during the development of /Snake Eater/. A bizarre, worthwhile trip.

4/5
* Metroid Prime
/Ocarina of Time/ and /Super Mario 64/ get all the credit for adapting their 2D predecessors for the new 3D-capable world, but /Metroid Prime/ deserves to be discussed with them. A fantastic atmosphere and sense of loneliness as you explore the world. The synth-heavy ambient/industrial OST is fantastic and compeltely unexpected. Falls off slightly towards the end with a few non-obvious artifacts to find and the final two bosses being spongy slogs.

5/5
* Metroid Prime 2: Echoes
There's a good game in here held back by frustrating difficulty and frequently opaque requirements to advance.

3/5
* Middle Earth: Shadow of War
A mechanically competent but utterly forgettable modern open world (and I do not use those three words positively) adventure.

3/5
* Minecraft
I've never gotten far into the structured single player mode they added, but it reminds me of my childhood dreams of setting out and making my own fort. Coop is a plus.

4/5
* Mirror's Edge
Falls short of its potential with its short length and weak combat, but it's a great few hours of running through the city.

4/5
* Mirror's Edge Catalyst
There are about three hours' worth of good ideas and fun movement tech in this eight hour game. There's also a bad story with bad voice acting and outrageously bad writing.

3/5
* Monster Hunter Rise
A fully actualized video game equivalent of potato chips. There is much to be admired, but there's a ceiling on potato chips.

3/5
* Monster Train
Lacks the impeccable balance of /Slay the Spire/, but that's somewhat the point: you're supposed to focus on breaking it.
Satisfying for fans of roguelikes, but not incredibly heavy on tactics or puzzly feelings.

4/5
* Murder by Numbers
Would have rather played a good visual novel and a separate Picross game. Could really have used some more quality-of-life in the Picross half.

3/5
