_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-orgacf71ce" class="outline-2">
<h2 id="orgacf71ce">Just Cause 2</h2>
<div class="outline-text-2" id="text-orgacf71ce">
<p>
A seminal game in the genre of open world absurdist power fantasies solely thanks to the grappling hook.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgf27923c" class="outline-2">
<h2 id="orgf27923c">Kerbal Space Program</h2>
<div class="outline-text-2" id="text-orgf27923c">
<p>
Taught me more about physics than my entire formal education. I played in the Scott Manley era, before much of the structure later added, and while a bit spartan in presentation, I still remember landing on Minmus and the Mun.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org82a65b7" class="outline-2">
<h2 id="org82a65b7">L.A. Noire</h2>
<div class="outline-text-2" id="text-org82a65b7">
<p>
As a technical experiment, a great success. As a game, not so much. The unnecessary driving and combat are obvious concessions to the <i>GTA</i> crowd, your interviewee&rsquo;s tells are all too obvious, but mostly, I&rsquo;m still annoyed at when the game withholds information from you in a case, lets you fail, and chews you out for it. Compare that with when I failed as a cop in <i>Disco Elysium</i>, which brought out real emotions and feelings of inadequacy, which the game was going for.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-orgcc4616c" class="outline-2">
<h2 id="orgcc4616c">Luftrausers</h2>
<div class="outline-text-2" id="text-orgcc4616c">
<p>
An amusing diversion for a few hours, but I absolutely do not care for endless arcade games.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org06e35bc" class="outline-2">
<h2 id="org06e35bc">Luigi&rsquo;s Mansion 3</h2>
<div class="outline-text-2" id="text-org06e35bc">
<p>
Charming action/puzzler. Next Level Games clearly put a lot of effort into the animation, and it shows.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org958b5e9" class="outline-2">
<h2 id="org958b5e9">Major League Baseball Featuring Ken Griffey Jr.</h2>
<div class="outline-text-2" id="text-org958b5e9">
<p>
Surprisingly fun arcadey baseball, but there&rsquo;s not much to keep you coming back.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgaf8a8f1" class="outline-2">
<h2 id="orgaf8a8f1">Mario Golf (GBC)</h2>
<div class="outline-text-2" id="text-orgaf8a8f1">
<p>
The GBC version of <i>Mario Golf</i> was inexplicably an RPG, and boy, does it work. The surprisingly deep golf mechanics are sound, and the RPG quest makes great use of them with a host of varied challenges in addition to more vanilla golf.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org694ed68" class="outline-2">
<h2 id="org694ed68">Mario Kart 7</h2>
<div class="outline-text-2" id="text-org694ed68">
<p>
A mundane entry in the series, but portable online <i>Mario Kart</i> is still an easy sell.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org0260cf7" class="outline-2">
<h2 id="org0260cf7">Mario Kart 8 Deluxe</h2>
<div class="outline-text-2" id="text-org0260cf7">
<p>
The standard &ldquo;I dunno, what do you wanna play&rdquo; when hosting and playing video games. A bit less fun solo or online, but still gorgeous and with a large variety of tracks.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgbf9aec5" class="outline-2">
<h2 id="orgbf9aec5">Mario Kart DS</h2>
<div class="outline-text-2" id="text-orgbf9aec5">
<p>
It&rsquo;s a fine entry in the series, but wireless local and online multiplayer were huge. This was the first time I ever played a game online outside of my home. I was at an airport and it blew my mind. Now we live in a world where I tether my Switch to my phone while on line at a restaurant to squeeze in some <i>Splatoon</i> and support Team Ketchup.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgcd79622" class="outline-2">
<h2 id="orgcd79622">Mario Party</h2>
<div class="outline-text-2" id="text-orgcd79622">
<p>
It would be easy to be unfairly harsh on the progenitor of the modern party game, whether for its randomness, graphics, or minigames that resulted in physical pain, but it caught on for a reason. That said, if I want a social experience with a moderately sized group of people, I&rsquo;m reaching for a board game. Looking at each other instead of a screen.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orga5701ad" class="outline-2">
<h2 id="orga5701ad">Mario + Rabbids: Kingdom Battle</h2>
<div class="outline-text-2" id="text-orga5701ad">
<p>
This game has absolutely no business being a satisfying tactical battler. The liberal movement system is a blast, and it&rsquo;s surprisingly tricky at times. Would be significantly better if you could take Mario out of your party.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org3b4a1de" class="outline-2">
<h2 id="org3b4a1de">Mass Effect</h2>
<div class="outline-text-2" id="text-org3b4a1de">
<p>
The black sheep of the series for its clunky combat, the original Mass Effect nevertheless has the best worldbuilding and story of them all.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org4df2c39" class="outline-2">
<h2 id="org4df2c39">Mass Effect 2</h2>
<div class="outline-text-2" id="text-org4df2c39">
<p>
Well written, deeply emotional, and featuring actually competent gunplay. BioWare&rsquo;s finest outing.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org3ea0177" class="outline-2">
<h2 id="org3ea0177">Mass Effect 3</h2>
<div class="outline-text-2" id="text-org3ea0177">
<p>
The price of Mass Effect 2 spending its time on what amount to sidequests to develop its cast is that Mass Effect 3&rsquo;s story has entirely too much ground to cover. The unsatisfying ending cannot take away from the dozens of hours preceding it in video gaming&rsquo;s finest space epic.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgd273f73" class="outline-2">
<h2 id="orgd273f73">Metal Gear Solid 3D: Snake Eater</h2>
<div class="outline-text-2" id="text-orgd273f73">
<p>
Has anyone ever tried saying no to Kojima? Certainly not during the development of <i>Snake Eater</i>. A bizarre, worthwhile trip.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org6093f93" class="outline-2">
<h2 id="org6093f93">Metroid Prime</h2>
<div class="outline-text-2" id="text-org6093f93">
<p>
<i>Ocarina of Time</i> and <i>Super Mario 64</i> get all the credit for adapting their 2D predecessors for the new 3D-capable world, but <i>Metroid Prime</i> deserves to be discussed with them. A fantastic atmosphere and sense of loneliness as you explore the world. The synth-heavy ambient/industrial OST is fantastic and compeltely unexpected. Falls off slightly towards the end with a few non-obvious artifacts to find and the final two bosses being spongy slogs.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org3c96058" class="outline-2">
<h2 id="org3c96058">Metroid Prime 2: Echoes</h2>
<div class="outline-text-2" id="text-org3c96058">
<p>
There&rsquo;s a good game in here held back by frustrating difficulty and frequently opaque requirements to advance.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org12222e6" class="outline-2">
<h2 id="org12222e6">Middle Earth: Shadow of War</h2>
<div class="outline-text-2" id="text-org12222e6">
<p>
A mechanically competent but utterly forgettable modern open world (and I do not use those three words positively) adventure.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org2abbc01" class="outline-2">
<h2 id="org2abbc01">Minecraft</h2>
<div class="outline-text-2" id="text-org2abbc01">
<p>
I&rsquo;ve never gotten far into the structured single player mode they added, but it reminds me of my childhood dreams of setting out and making my own fort. Coop is a plus.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org6ce3e68" class="outline-2">
<h2 id="org6ce3e68">Mirror&rsquo;s Edge</h2>
<div class="outline-text-2" id="text-org6ce3e68">
<p>
Falls short of its potential with its short length and weak combat, but it&rsquo;s a great few hours of running through the city.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgde5d036" class="outline-2">
<h2 id="orgde5d036">Mirror&rsquo;s Edge Catalyst</h2>
<div class="outline-text-2" id="text-orgde5d036">
<p>
There are about three hours&rsquo; worth of good ideas and fun movement tech in this eight hour game. There&rsquo;s also a bad story with bad voice acting and outrageously bad writing.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org87c9274" class="outline-2">
<h2 id="org87c9274">Monster Hunter Rise</h2>
<div class="outline-text-2" id="text-org87c9274">
<p>
A fully actualized video game equivalent of potato chips. There is much to be admired, but there&rsquo;s a ceiling on potato chips.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org7923e59" class="outline-2">
<h2 id="org7923e59">Monster Train</h2>
<div class="outline-text-2" id="text-org7923e59">
<p>
Lacks the impeccable balance of <i>Slay the Spire</i>, but that&rsquo;s somewhat the point: you&rsquo;re supposed to focus on breaking it.
Satisfying for fans of roguelikes, but not incredibly heavy on tactics or puzzly feelings.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orga550eee" class="outline-2">
<h2 id="orga550eee">Murder by Numbers</h2>
<div class="outline-text-2" id="text-orga550eee">
<p>
Would have rather played a good visual novel and a separate Picross game. Could really have used some more quality-of-life in the Picross half.
</p>

<p>
3/5
</p>
</div>
</div>
