org/2021-09-25-video-game-reviews.org
* N++
Hypothetically hits a lot of my favorite notes as a difficult 2D platformer with short levels and instant retries. It falls short in how it handles its difficulty. Many levels are trivial and only challenging if going for optional gold, but unlike the strawberries and bandages of /Celeste/ and /Super Meat Boy/, there are often dozens of gold pieces on an individual level, making them a completionist annoyance instead of a one-off challenge. I also prefer the speed of those games over the heavy, momentum-based /N++/.

3/5
* New Super Mario Bros.
Safe, but the formula works.

4/5
* New Super Mario Bros. U Deluxe
The main game is dull but good for local coop. The included Luigi DLC, however, is challenging and imaginative enough to be a worthwhile take on the New Super Mario Bros. series. Ultimately, I'd rather play something like /Celeste/ or /Super Meat Boy/.

3/5
* Octopath Traveler
The game that made me realize how little patience I have for most JRPGs' storytelling. Classic combat, banal plot. The true ending, which perhaps ties everything together, is hidden well and locked behind content I will never bother to slog through.

3/5
* Outer Wilds
Lovely sci-fi explorer/puzzler/mystery, with a few big reveals that hit hard.
I appreciate needing to think, though it could be a little obtuse on occassion.
Not infrequently annoying from running out of time right when finishing a puzzle or being killed by the actively harmful autopilot.

4/5
* Paper Mario: The Thousand-Year Door
Not the first comedy RPG, but a laugh-out-loud romp. Very subversive considering this is Nintendo's golden goose.

4/5
* Papers, Please
An outstanding art project, brimming with unstated but effective commentary about life under a totalitarian regime developed organically through the gameplay. But while a stressful, unpleasant, sometimes poorly explained paperwork simulator is an appropriate vehicle for its themes, I cannot say that I enjoyed my experience.

4/5
* Persona 3 Portable
It's hard not to judge this one unfairly after playing /5/ and /4/, especially with the PSP version's almost complete lack of 3D graphics or anime cutscenes stripping the game of so much atmosphere. But then again, the dungeon crawl is pointless padding of no interest or difficulty, the bosses are too easy save for a handful of level checks forcing grinding, the story seems to forget to do anything for entire in-game months at a time, and few of the songs can touch the OSTs from /4/ or /5/. I am shocked at how skippable this is.

3/5
* Persona 4 Arena Ultimax
I don't like most fighting games. /P4AU/ expects that and will even play out its story mode battles for you, although I found button mashing mostly adequate.
Way too much redundancy in the story modes, especially in the original campaign.
It's basically an uniteractive visual novel, but it's also more time with the Investigation Team and SEES.

3/5
* Persona 4 Golden
A well done mystery with excellent, developed characters. Compared to /Persona 5/, the music, art, and JRPG parts aren't as strong, but the narrative is better paced and perhaps better told.

5/5
* Persona 5
The best JRPG I have ever played (though as of this writing, also the only /Persona/ game I've played). Story, art, and music are all outstanding, but what sets it apart for me is the back-and-forth between the life simulator and dungeon crawling halves. Each enhances the other (I've strengthened a bond with this friend and now they have this ability; I've completed a palace and now can hang out with this friend and can now hang out with them) in a way that, coupled with the aforementioned plot and presentation, manages to hold up over its very long runtime.

5/5
* Persona 5 Strikers
Another powerful, emotionally resonant story supported by stellar art and music. Gameplay translates surprisingly well to the /musou/ genre, though once it clicks, it's not particularly challenging even on hard. A must-play for /Persona 5/ phans.

5/5
* Pikmin 3 Deluxe
Played entirely in coop mode. Enjoyable light RTS/action/puzzler that unfortunately ends with a supremely unsatisfying difficulty spike.

3/5
* Pillars of Eternity
It's clear that Obsidian put extraordinary effort into building the world of Eora, but the entire game is an overwhelming exposition dump. This is not a recipe for a compelling story-and-character-heavy RPG, and the plodding combat is unforgivable.

2/5
* Pillars of Eternity II: Deadfire
A remarkable turnaround after the original. Better combat AI and lower difficulty make the game flow better, and the writing, voice acting, and presentation are all a big step up. As close as we'll ever get to DnD Pirates: The Video Game.

4/5
* Pilotwings 64
Packed to the gills with challenges, from flying through rings to using missiles to fight a robotic kaiju. The USA-based level blew my mind as a kid.

4/5
* Pilotwings Resort
A handheld game for the final handheld era. A little too simple, but not so much that it's not still fun to try to score higher.

3/5
* Plants vs Zombies
Far better, more charming, and more interesting than a casual tower defense game has any right to be.

4/5
* Pokémon Black/White
/Black/ and /White/ make the bold choice of only using the new region's Pokémon for the main game, pretty shocking for a series that has given us more than a half-dozen Pikachu variants. I appreciate that it forces you into the unfamiliar, though it's otherwise pretty mundane.

4/5
* Pokémon Diamond/Pearl
The Global Trade System is one of the two best features the series ever added along with post-game battling. Suddenly collecting them all was that much more feasible. Years later The sprites were also phenomenal, full of color and detail.

5/5
