_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-orgf396bef" class="outline-2">
<h2 id="orgf396bef">N++</h2>
<div class="outline-text-2" id="text-orgf396bef">
<p>
Hypothetically hits a lot of my favorite notes as a difficult 2D platformer with short levels and instant retries. It falls short in how it handles its difficulty. Many levels are trivial and only challenging if going for optional gold, but unlike the strawberries and bandages of <i>Celeste</i> and <i>Super Meat Boy</i>, there are often dozens of gold pieces on an individual level, making them a completionist annoyance instead of a one-off challenge. I also prefer the speed of those games over the heavy, momentum-based <i>N++</i>.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgf6d8f03" class="outline-2">
<h2 id="orgf6d8f03">New Super Mario Bros.</h2>
<div class="outline-text-2" id="text-orgf6d8f03">
<p>
Safe, but the formula works.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org6a19006" class="outline-2">
<h2 id="org6a19006">New Super Mario Bros. U Deluxe</h2>
<div class="outline-text-2" id="text-org6a19006">
<p>
The main game is dull but good for local coop. The included Luigi DLC, however, is challenging and imaginative enough to be a worthwhile take on the New Super Mario Bros. series. Ultimately, I&rsquo;d rather play something like <i>Celeste</i> or <i>Super Meat Boy</i>.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org44a90df" class="outline-2">
<h2 id="org44a90df">Octopath Traveler</h2>
<div class="outline-text-2" id="text-org44a90df">
<p>
The game that made me realize how little patience I have for most JRPGs&rsquo; storytelling. Classic combat, banal plot. The true ending, which perhaps ties everything together, is hidden well and locked behind content I will never bother to slog through.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org69ff7d4" class="outline-2">
<h2 id="org69ff7d4">Outer Wilds</h2>
<div class="outline-text-2" id="text-org69ff7d4">
<p>
Lovely sci-fi explorer/puzzler/mystery, with a few big reveals that hit hard.
I appreciate needing to think, though it could be a little obtuse on occassion.
Not infrequently annoying from running out of time right when finishing a puzzle or being killed by the actively harmful autopilot.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org8466313" class="outline-2">
<h2 id="org8466313">Paper Mario: The Thousand-Year Door</h2>
<div class="outline-text-2" id="text-org8466313">
<p>
Not the first comedy RPG, but a laugh-out-loud romp. Very subversive considering this is Nintendo&rsquo;s golden goose.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgc4983e2" class="outline-2">
<h2 id="orgc4983e2">Papers, Please</h2>
<div class="outline-text-2" id="text-orgc4983e2">
<p>
An outstanding art project, brimming with unstated but effective commentary about life under a totalitarian regime developed organically through the gameplay. But while a stressful, unpleasant, sometimes poorly explained paperwork simulator is an appropriate vehicle for its themes, I cannot say that I enjoyed my experience.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org0c6168d" class="outline-2">
<h2 id="org0c6168d">Persona 3 Portable</h2>
<div class="outline-text-2" id="text-org0c6168d">
<p>
It&rsquo;s hard not to judge this one unfairly after playing <i>5</i> and <i>4</i>, especially with the PSP version&rsquo;s almost complete lack of 3D graphics or anime cutscenes stripping the game of so much atmosphere. But then again, the dungeon crawl is pointless padding of no interest or difficulty, the bosses are too easy save for a handful of level checks forcing grinding, the story seems to forget to do anything for entire in-game months at a time, and few of the songs can touch the OSTs from <i>4</i> or <i>5</i>. I am shocked at how skippable this is.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgc56133a" class="outline-2">
<h2 id="orgc56133a">Persona 4 Arena Ultimax</h2>
<div class="outline-text-2" id="text-orgc56133a">
<p>
I don&rsquo;t like most fighting games. <i>P4AU</i> expects that and will even play out its story mode battles for you, although I found button mashing mostly adequate.
Way too much redundancy in the story modes, especially in the original campaign.
It&rsquo;s basically an uniteractive visual novel, but it&rsquo;s also more time with the Investigation Team and SEES.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org740db5f" class="outline-2">
<h2 id="org740db5f">Persona 4: Dancing All Night</h2>
<div class="outline-text-2" id="text-org740db5f">
<p>
Shockingly high-effort across all facets for what could have simply been a generic rhythm game set to <i>Persona</i> music.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgaa6a198" class="outline-2">
<h2 id="orgaa6a198">Persona 4 Golden</h2>
<div class="outline-text-2" id="text-orgaa6a198">
<p>
A well done mystery with excellent, developed characters. Compared to <i>Persona 5</i>, the music, art, and JRPG parts aren&rsquo;t as strong, but the narrative is better paced and perhaps better told.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org5799aa3" class="outline-2">
<h2 id="org5799aa3">Persona 5</h2>
<div class="outline-text-2" id="text-org5799aa3">
<p>
The best JRPG I have ever played (though as of this writing, also the only <i>Persona</i> game I&rsquo;ve played). Story, art, and music are all outstanding, but what sets it apart for me is the back-and-forth between the life simulator and dungeon crawling halves. Each enhances the other (I&rsquo;ve strengthened a bond with this friend and now they have this ability; I&rsquo;ve completed a palace and now can hang out with this friend and can now hang out with them) in a way that, coupled with the aforementioned plot and presentation, manages to hold up over its very long runtime.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org047a3de" class="outline-2">
<h2 id="org047a3de">Persona 5 Strikers</h2>
<div class="outline-text-2" id="text-org047a3de">
<p>
Another powerful, emotionally resonant story supported by stellar art and music. Gameplay translates surprisingly well to the <i>musou</i> genre, though once it clicks, it&rsquo;s not particularly challenging even on hard. A must-play for <i>Persona 5</i> phans.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org0876a7d" class="outline-2">
<h2 id="org0876a7d">Persona Q</h2>
<div class="outline-text-2" id="text-org0876a7d">
<p>
Mapping out dungeons is cute, but held back by the small size and low resolution of my launch-era 3DS: seeing small details on the top screen is a pain, and plotting them on the touchscreen is clunky. This is made worse by insipid random battles and uneven difficulty. More time with SEES and the Investigation Team isn&rsquo;t as fun as it could be since everyone is Flanderized.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org951b27a" class="outline-2">
<h2 id="org951b27a">Pikmin 3 Deluxe</h2>
<div class="outline-text-2" id="text-org951b27a">
<p>
Played entirely in coop mode. Enjoyable light RTS/action/puzzler that unfortunately ends with a supremely unsatisfying difficulty spike.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org82c6d7a" class="outline-2">
<h2 id="org82c6d7a">Pillars of Eternity</h2>
<div class="outline-text-2" id="text-org82c6d7a">
<p>
It&rsquo;s clear that Obsidian put extraordinary effort into building the world of Eora, but the entire game is an overwhelming exposition dump. This is not a recipe for a compelling story-and-character-heavy RPG, and the plodding combat is unforgivable.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org11f8239" class="outline-2">
<h2 id="org11f8239">Pillars of Eternity II: Deadfire</h2>
<div class="outline-text-2" id="text-org11f8239">
<p>
A remarkable turnaround after the original. Better combat AI and lower difficulty make the game flow better, and the writing, voice acting, and presentation are all a big step up. As close as we&rsquo;ll ever get to DnD Pirates: The Video Game.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org5eafc69" class="outline-2">
<h2 id="org5eafc69">Pilotwings 64</h2>
<div class="outline-text-2" id="text-org5eafc69">
<p>
Packed to the gills with challenges, from flying through rings to using missiles to fight a robotic kaiju. The USA-based level blew my mind as a kid.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org734ea45" class="outline-2">
<h2 id="org734ea45">Pilotwings Resort</h2>
<div class="outline-text-2" id="text-org734ea45">
<p>
A handheld game for the final handheld era. A little too simple, but not so much that it&rsquo;s not still fun to try to score higher.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org48a572f" class="outline-2">
<h2 id="org48a572f">Plants vs Zombies</h2>
<div class="outline-text-2" id="text-org48a572f">
<p>
Far better, more charming, and more interesting than a casual tower defense game has any right to be.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgf05468c" class="outline-2">
<h2 id="orgf05468c">Pokémon Black/White</h2>
<div class="outline-text-2" id="text-orgf05468c">
<p>
<i>Black</i> and <i>White</i> make the bold choice of only using the new region&rsquo;s Pokémon for the main game, pretty shocking for a series that has given us more than a half-dozen Pikachu variants. I appreciate that it forces you into the unfamiliar, though it&rsquo;s otherwise pretty mundane.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org2bc1a40" class="outline-2">
<h2 id="org2bc1a40">Pokémon Diamond/Pearl</h2>
<div class="outline-text-2" id="text-org2bc1a40">
<p>
The Global Trade System is one of the two best features the series ever added along with post-game battling. Suddenly collecting them all was that much more feasible. Years later The sprites were also phenomenal, full of color and detail.
</p>

<p>
5/5
</p>
</div>
</div>
