org/2021-09-25-video-game-reviews.org
* Pokémon Omega Ruby/Alpha Sapphire
Stressed during my senior year of college, I decided that I'd try to complete the National Pokédex in /Omega Ruby/. Armed with [[https://serebii.net/][Serebii.net]] and some elaborate spreadsheeting, I saw that between /Omega Ruby/, my ancient copy of /Diamond/ and more recent /X/, all I needed was /Black/ to get everything. This required driving out to a GameStop for a disappointingly expensive /Black/ and borrowing another DS to facilitate transferring Pokémon from generation IV (some of whom had already come from III!) into VI. And it was fantastic in a compulsive, completionist sort of way. ORAS are bright and joyful, if somewhat pedestrian for the series, but generation VI was also an impressive culmination of catch 'em all ethos thanks to the many transfer and trade mechanisms.

4/5
* Pokémon Pinball
I want to like it, collecting Pokémon is a great hook for pinball, but wow, this game is punishing.

2/5
* Pokémon Pinball: Ruby & Sapphire
I want to like it, collecting Pokémon is a great hook for pinball, but wow, this game is easy.

2/5
* Pokémon Sun/Moon
There's nothing here besides Rowlet, their best starter in years. Slow and insulting.

3/5
* Pokémon X/Y
Although it wasn't actually the first 3D Pokémon RPG (that would be /Gale of Darkness/ on the Gamecube), the series mostly stuck the landing, and Lumiose City scope in particular was a revelation after years of sprite-based cities. Sure, the pacing is too slow, the story is even more nonsensical than usual, and it's easy, but it actually did something new for the series.

4/5
* Portal
The surprise hit from /The Orange Box/. Clever and witty and writing and gameplay.

5/5
* Portal 2
Valve's painstakingly detailed playtesting pays off in that there are 0 rough edges anywhere in /Portal 2/. I could complain that the original had more charm, but really, it's one of the funniest games of all time and the puzzles are fine.

5/5
* Prey (2017)
Old-school immersive sim. A damn smart game. Beautifully open, with some actually interesting choices and story beats.

5/5
* Psychonauts
Drawing on Jungian psychology is a great premise for a game (just ask /Persona/), but the actual game is a technically unsound platformer whose core loop was outdated and outclassed even in 2005.

2/5
* Puyo Puyo Tetris
The game that made me realize I like Tetris. Puyo Puyo I can take or leave, but combining the two in local multiplayer with other novices is a real "pat your head and rub your belly" competition.

4/5
* Puyo Puyo Tetris 2
It's the same thing as the original.
I am deeply amused by the supremely unserious script and how much talent went into performing it.

4/5
* Rayman Legends: Definitive Edition
A platformer for the platformer fan. Really impressed by the amount of content, with enough ideas to stay fresh throughout.

4/5
* Red Dead Redemption 2
/RDR2/ is stunning. The scope is massive, making its obsessive details even more gratuitous. The sheer number of systems in the game make it feel almost like an immersive sim at times with a consistent internal logic, and I can point to any number of moments where they all came together for an experience few other open world games are capable of. The problem, then, is that there's barely a game in there, which really hurts over the course of a 50+ hour story. This is a Rockstar game, and most missions boil down to riding your horse somewhere or shooting comically large numbers of people, with entirely too many actions reduced to button prompts on a frustratingly inconsistent control scheme. At times, this feels like the world's most overproduced animated cowboy show. I won't say it doesn't respect the player's time, but it has a vision that results in very large amounts of downtime for the player. Nevertheless, the core systems of /RDR2/ are incredible, and especially when it gets out of its own way enough for the player to hunt down a perfect animal or make a clean robbery, it's one of the most fully realized digital worlds in gaming history. As an aside, Rockstar's DRM is awful, and on multiple occasions I've gone through the multi-minute song and dance of launching the game only to be told falsely that my account is not allowed to play. That plus the plodding pace make for a very high fixed cost to a play session.

5/5
* Resident Evil 4
Delightfully campy. And the gameplay, despite the oft-maligned tank controls, is fun, if dated.

4/5
* Return of the Obra Dinn
As a general sucker for games as art, auteurs, and feeling clever, yeah, of course I liked the indie murder mystery. I have a few minor quibbles about quality of life and a few of the fates, but from a game design perspective, /Obra Dinn/ does an incredible job of balancing pure deduction and metagaming to prevent getting stuck, so hats off to Lukas Pope.

5/5
* Rise of the Tomb Raider
One of the more tolerable modern open-world action games. Combat, crafting, stealth, and the tombs are all adequate.

4/5
* Rocket League
Multiplayer car soccer/rugby that's dumb fun at all levels, with an impressively high skill ceiling.

4/5
* Sekiro: Shadows Die Twice
They tell me that I need to get good and spend a few days mastering the dance of its combat. I don't find that fun, and my video game time is limited enough that I don't want to. Very disappointed. The experience would not have been ruined with difficulty options, but many more people would have been able to access it and enjoy zipping around a gorgeous world as a ninja. Isn't that what we all want?

2/5
* Sea of Stars
It's Chrono Trigger, which was a good game, and so is this.
Some great moments and some nits to pick/genre staples that sour things a tad, especially the slow backtracking and one certain 60-part fetch quest.

4/5
* Shadow Complex
Emblematic of the best of the Xbox Live Arcade, any fan of Metroidvanias should play it.

4/5
