_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-org2616fe1" class="outline-2">
<h2 id="org2616fe1">Pokémon Omega Ruby/Alpha Sapphire</h2>
<div class="outline-text-2" id="text-org2616fe1">
<p>
Stressed during my senior year of college, I decided that I&rsquo;d try to complete the National Pokédex in <i>Omega Ruby</i>. Armed with <a href="https://serebii.net/">Serebii.net</a> and some elaborate spreadsheeting, I saw that between <i>Omega Ruby</i>, my ancient copy of <i>Diamond</i> and more recent <i>X</i>, all I needed was <i>Black</i> to get everything. This required driving out to a GameStop for a disappointingly expensive <i>Black</i> and borrowing another DS to facilitate transferring Pokémon from generation IV (some of whom had already come from III!) into VI. And it was fantastic in a compulsive, completionist sort of way. ORAS are bright and joyful, if somewhat pedestrian for the series, but generation VI was also an impressive culmination of catch &rsquo;em all ethos thanks to the many transfer and trade mechanisms.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org34dc642" class="outline-2">
<h2 id="org34dc642">Pokémon Pinball</h2>
<div class="outline-text-2" id="text-org34dc642">
<p>
I want to like it, collecting Pokémon is a great hook for pinball, but wow, this game is punishing.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org93f8e12" class="outline-2">
<h2 id="org93f8e12">Pokémon Pinball: Ruby &amp; Sapphire</h2>
<div class="outline-text-2" id="text-org93f8e12">
<p>
I want to like it, collecting Pokémon is a great hook for pinball, but wow, this game is easy.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-orgb9b8815" class="outline-2">
<h2 id="orgb9b8815">Pokémon Sun/Moon</h2>
<div class="outline-text-2" id="text-orgb9b8815">
<p>
There&rsquo;s nothing here besides Rowlet, their best starter in years. Slow and insulting.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org03a831f" class="outline-2">
<h2 id="org03a831f">Pokémon X/Y</h2>
<div class="outline-text-2" id="text-org03a831f">
<p>
Although it wasn&rsquo;t actually the first 3D Pokémon RPG (that would be <i>Gale of Darkness</i> on the Gamecube), the series mostly stuck the landing, and Lumiose City scope in particular was a revelation after years of sprite-based cities. Sure, the pacing is too slow, the story is even more nonsensical than usual, and it&rsquo;s easy, but it actually did something new for the series.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org33831fc" class="outline-2">
<h2 id="org33831fc">Portal</h2>
<div class="outline-text-2" id="text-org33831fc">
<p>
The surprise hit from <i>The Orange Box</i>. Clever and witty and writing and gameplay.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org9e6f525" class="outline-2">
<h2 id="org9e6f525">Portal 2</h2>
<div class="outline-text-2" id="text-org9e6f525">
<p>
Valve&rsquo;s painstakingly detailed playtesting pays off in that there are 0 rough edges anywhere in <i>Portal 2</i>. I could complain that the original had more charm, but really, it&rsquo;s one of the funniest games of all time and the puzzles are fine.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgd5d2ddf" class="outline-2">
<h2 id="orgd5d2ddf">Prey (2017)</h2>
<div class="outline-text-2" id="text-orgd5d2ddf">
<p>
Old-school immersive sim. A damn smart game. Beautifully open, with some actually interesting choices and story beats.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org24a355e" class="outline-2">
<h2 id="org24a355e">Psychonauts</h2>
<div class="outline-text-2" id="text-org24a355e">
<p>
Drawing on Jungian psychology is a great premise for a game (just ask <i>Persona</i>), but the actual game is a technically unsound platformer whose core loop was outdated and outclassed even in 2005.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-orgde2aacd" class="outline-2">
<h2 id="orgde2aacd">Puyo Puyo Tetris</h2>
<div class="outline-text-2" id="text-orgde2aacd">
<p>
The game that made me realize I like Tetris. Puyo Puyo I can take or leave, but combining the two in local multiplayer with other novices is a real &ldquo;pat your head and rub your belly&rdquo; competition.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org2f1af46" class="outline-2">
<h2 id="org2f1af46">Puyo Puyo Tetris 2</h2>
<div class="outline-text-2" id="text-org2f1af46">
<p>
It&rsquo;s the same thing as the original.
I am deeply amused by the supremely unserious script and how much talent went into performing it.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org151bd84" class="outline-2">
<h2 id="org151bd84">Rayman Legends: Definitive Edition</h2>
<div class="outline-text-2" id="text-org151bd84">
<p>
A platformer for the platformer fan. Really impressed by the amount of content, with enough ideas to stay fresh throughout.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgdf34545" class="outline-2">
<h2 id="orgdf34545">Red Dead Redemption 2</h2>
<div class="outline-text-2" id="text-orgdf34545">
<p>
<i>RDR2</i> is stunning. The scope is massive, making its obsessive details even more gratuitous. The sheer number of systems in the game make it feel almost like an immersive sim at times with a consistent internal logic, and I can point to any number of moments where they all came together for an experience few other open world games are capable of. The problem, then, is that there&rsquo;s barely a game in there, which really hurts over the course of a 50+ hour story. This is a Rockstar game, and most missions boil down to riding your horse somewhere or shooting comically large numbers of people, with entirely too many actions reduced to button prompts on a frustratingly inconsistent control scheme. At times, this feels like the world&rsquo;s most overproduced animated cowboy show. I won&rsquo;t say it doesn&rsquo;t respect the player&rsquo;s time, but it has a vision that results in very large amounts of downtime for the player. Nevertheless, the core systems of <i>RDR2</i> are incredible, and especially when it gets out of its own way enough for the player to hunt down a perfect animal or make a clean robbery, it&rsquo;s one of the most fully realized digital worlds in gaming history. As an aside, Rockstar&rsquo;s DRM is awful, and on multiple occasions I&rsquo;ve gone through the multi-minute song and dance of launching the game only to be told falsely that my account is not allowed to play. That plus the plodding pace make for a very high fixed cost to a play session.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org631849e" class="outline-2">
<h2 id="org631849e">Resident Evil 4</h2>
<div class="outline-text-2" id="text-org631849e">
<p>
Delightfully campy. And the gameplay, despite the oft-maligned tank controls, is fun, if dated.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org4785103" class="outline-2">
<h2 id="org4785103">Return of the Obra Dinn</h2>
<div class="outline-text-2" id="text-org4785103">
<p>
As a general sucker for games as art, auteurs, and feeling clever, yeah, of course I liked the indie murder mystery. I have a few minor quibbles about quality of life and a few of the fates, but from a game design perspective, <i>Obra Dinn</i> does an incredible job of balancing pure deduction and metagaming to prevent getting stuck, so hats off to Lukas Pope.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orga6bc5b6" class="outline-2">
<h2 id="orga6bc5b6">Rise of the Tomb Raider</h2>
<div class="outline-text-2" id="text-orga6bc5b6">
<p>
One of the more tolerable modern open-world action games. Combat, crafting, stealth, and the tombs are all adequate.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgea3304b" class="outline-2">
<h2 id="orgea3304b">Rocket League</h2>
<div class="outline-text-2" id="text-orgea3304b">
<p>
Multiplayer car soccer/rugby that&rsquo;s dumb fun at all levels, with an impressively high skill ceiling.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org13be595" class="outline-2">
<h2 id="org13be595">Sekiro: Shadows Die Twice</h2>
<div class="outline-text-2" id="text-org13be595">
<p>
They tell me that I need to get good and spend a few days mastering the dance of its combat. I don&rsquo;t find that fun, and my video game time is limited enough that I don&rsquo;t want to. Very disappointed. The experience would not have been ruined with difficulty options, but many more people would have been able to access it and enjoy zipping around a gorgeous world as a ninja. Isn&rsquo;t that what we all want?
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org8935999" class="outline-2">
<h2 id="org8935999">Sea of Stars</h2>
<div class="outline-text-2" id="text-org8935999">
<p>
It&rsquo;s Chrono Trigger, which was a good game, and so is this.
Some great moments and some nits to pick/genre staples that sour things a tad, especially the slow backtracking and one certain 60-part fetch quest.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgfe02d3d" class="outline-2">
<h2 id="orgfe02d3d">Shadow Complex</h2>
<div class="outline-text-2" id="text-orgfe02d3d">
<p>
Emblematic of the best of the Xbox Live Arcade, any fan of Metroidvanias should play it.
</p>

<p>
4/5
</p>
</div>
</div>
