org/2021-09-25-video-game-reviews.org
* Shadow of the Colossus
Where /ICO/ fails as a game, /Shadow of the Colossus/ makes some concessions to its vision (look, a HUD!) to more than make up for it with this classic. Every colossus is an intricate puzzle, and the sense of scale, the physics as Wander gets tossed around, and the epic score all combine for an unforgettable experience. Of all the usual "games as art" suspects, /Shadow of the Colossus/ is perhaps the strongest on the gameplay front.

5/5
* Shadow of the Tomb Raider
The puzzling is great, it's just surrounded by an eye-rollingly poor story and mediocre combat. The dissonance between Lara's development as a stone-cold killer who must save the world and the tender-hearted young woman who takes the time to help a young boy get his dice back is immersion-breaking.

3/5
* Shadow Tactics: Blades of the Shogun
As someone with no experience with the /Commandos/ games, I was pleasantly surprised at the extent to which /Blades of the Shogun/ scratched my puzzly tactics itch much like /Hitman/ or /XCOM/ before it.

4/5
* Shovel Knight: Treasure Trove
All four campaigns feel fresh and impeccably designed around each character's abilities. A modern classic in every sense.

5/5
* Sid Meier's Civilization IV
You know what, just look at the /VI/ review.


4/5
* Sid Meier's Civilization V
You know what, just look at the /VI/ review.

4/5
* Sid Meier's Civilization VI
Having never gotten especially good at Civ, it's still a shockingly addictive set of systems, but I find it overwhelming and prefer smaller, more tactical experiences.

4/5
* Skate
Really nails the core loop of skating around San Vanelona, finding a spot, and hitting the perfect line.

4/5
* Skate 3
Played on hardcore, it is equal parts frustrating and rewarding. Some of the missions and goals are boring or too hard, but it will always be cool to find a spot and nail the perfect line.

4/5
* Slay the Spire
Enemy intentions are a fantastic mechanic, and it's probably no coincidence that I also enjoy /Spirit Island/ and /Into the Breach/. All four classes are great, and the base game's modular difficulty ensures an appropriate experience. The true final boss isn't worth doing other than for the achievements, though, as it limits the deckbuilding too much.

4/5
* Snipperclips
A favorite for couch coop. Adorable and requires all players to contribute.

4/5
* Sonic Adventure
Unredeemable. There was no part of this I enjoyed.

1/5
* Sonic Colors (DS)
Serviceable 2D /Sonic/.

3/5
* Sonic Mania
The platonic ideal Sonic game, with delightful throwback graphics and soundtrack with top-notch level design. Unfortunately, the Sonic formula is fundamentally flawed. The game wants you to fly through levels, but without replaying and memorizing levels, the gameplay is either effectively an autoscroller or failing to go fast by hitting obstacles or falling.

4/5
* South Park: The Fractured But Whole
A bit less funny than its predecessor, but with a massively more interesting combat system. The difficulty slider is one of my favorite bits of social commentary the show has done.

4/5
* South Park: The Stick of Truth
As a playable /South Park/, very funny and worthwhile. More of a joke RPG than a real RPG though.

4/5
* Spec Ops: The Line
Overlook the painfully generic and slightly buggy cover shooter for the engaging narrative.

4/5
* Splatoon 2
I'm generally not big on multiplayer shooters, but the lack of a deathmatch and the weapon variety, as well as the new PVE mode, kept me coming back. Underrated soundtrack reminiscient of The Go! Team.

4/5
* Stardew Valley
When I had about 30 minutes before bed after struggling with problem sets all day in my first year of grad school, I would go to a simpler place, where life was a jam-packed gameplay loop of farming, fishing, foraging, and friendship. And the later addition of coop made for one of my favorite couple's games.

4/5
* Star Fox 64
As a genre novice, definitely my favorite rail shooter. Filled with details that reward replay like branching paths and secret segments, and of course, a simple, engaging scoring mechanism. I know every word of the script.

4/5
* Star Wars: Knights of the Old Republic
It's very dated, coming from the olden days of BioWare, but it's also one of the better /Star Wars/ story in the entire Expanded Universe (before Disney killed it).

4/5
* Star Wars: Knights of the Old Republic II
More of the same, but a bit weaker in the story department.

3/5
* SteamWorld Dig 2
There's not a bad SteamWorld game out there, and this is an unremarkable (but fun!) platformer.

4/5
* SteamWorld Heist
/XCOM/ meets /Worms/ does it for me.

4/5
* Sunset Overdrive
Was looking for stupid fun. Got a lot of stupid, some fun.

3/5
* SUPERHOT
Ostensibly a shooter, but the central conceit of a shooter where time only passes when you move ends up making it more of a puzzler. The story gets in the way a bit and is nowhere close to as clever as it thinks it is. Completely superseded by its VR version.

3/5
* SUPERHOT: MIND CONTROL DELETE
A roguelike SUPERHOT is a great concept, but the lack of content and amount of replaying levels necessary upon failure made me lose interest.

2/5
* SUPERHOT VR
It's /The Matrix/ in a game, with the immediacy and intuitiveness afforded by VR. By far, the coolest I have ever felt while playing a video game. ("Felt" is doing a lot of work in that sentence. I've seen video of me playing.)

5/5
* Super Mario 3D Land
As inoffensive and uninspired as the worst of the /NSMB/ games.

3/5
