_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-org960f943" class="outline-2">
<h2 id="org960f943">Shadow of the Colossus</h2>
<div class="outline-text-2" id="text-org960f943">
<p>
Where <i>ICO</i> fails as a game, <i>Shadow of the Colossus</i> makes some concessions to its vision (look, a HUD!) to more than make up for it with this classic. Every colossus is an intricate puzzle, and the sense of scale, the physics as Wander gets tossed around, and the epic score all combine for an unforgettable experience. Of all the usual &ldquo;games as art&rdquo; suspects, <i>Shadow of the Colossus</i> is perhaps the strongest on the gameplay front.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgf13b1c7" class="outline-2">
<h2 id="orgf13b1c7">Shadow of the Tomb Raider</h2>
<div class="outline-text-2" id="text-orgf13b1c7">
<p>
The puzzling is great, it&rsquo;s just surrounded by an eye-rollingly poor story and mediocre combat. The dissonance between Lara&rsquo;s development as a stone-cold killer who must save the world and the tender-hearted young woman who takes the time to help a young boy get his dice back is immersion-breaking.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgd7b45c5" class="outline-2">
<h2 id="orgd7b45c5">Shadow Tactics: Blades of the Shogun</h2>
<div class="outline-text-2" id="text-orgd7b45c5">
<p>
As someone with no experience with the <i>Commandos</i> games, I was pleasantly surprised at the extent to which <i>Blades of the Shogun</i> scratched my puzzly tactics itch much like <i>Hitman</i> or <i>XCOM</i> before it.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgc674328" class="outline-2">
<h2 id="orgc674328">Shovel Knight: Treasure Trove</h2>
<div class="outline-text-2" id="text-orgc674328">
<p>
All four campaigns feel fresh and impeccably designed around each character&rsquo;s abilities. A modern classic in every sense.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org526f239" class="outline-2">
<h2 id="org526f239">Sid Meier&rsquo;s Civilization IV</h2>
<div class="outline-text-2" id="text-org526f239">
<p>
You know what, just look at the <i>VI</i> review.
</p>


<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org7844dfd" class="outline-2">
<h2 id="org7844dfd">Sid Meier&rsquo;s Civilization V</h2>
<div class="outline-text-2" id="text-org7844dfd">
<p>
You know what, just look at the <i>VI</i> review.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orga29619b" class="outline-2">
<h2 id="orga29619b">Sid Meier&rsquo;s Civilization VI</h2>
<div class="outline-text-2" id="text-orga29619b">
<p>
Having never gotten especially good at Civ, it&rsquo;s still a shockingly addictive set of systems, but I find it overwhelming and prefer smaller, more tactical experiences.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org77e8127" class="outline-2">
<h2 id="org77e8127">Skate</h2>
<div class="outline-text-2" id="text-org77e8127">
<p>
Really nails the core loop of skating around San Vanelona, finding a spot, and hitting the perfect line.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org80beef9" class="outline-2">
<h2 id="org80beef9">Skate 3</h2>
<div class="outline-text-2" id="text-org80beef9">
<p>
Played on hardcore, it is equal parts frustrating and rewarding. Some of the missions and goals are boring or too hard, but it will always be cool to find a spot and nail the perfect line.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgebef740" class="outline-2">
<h2 id="orgebef740">Slay the Spire</h2>
<div class="outline-text-2" id="text-orgebef740">
<p>
Enemy intentions are a fantastic mechanic, and it&rsquo;s probably no coincidence that I also enjoy <i>Spirit Island</i> and <i>Into the Breach</i>. All four classes are great, and the base game&rsquo;s modular difficulty ensures an appropriate experience. The true final boss isn&rsquo;t worth doing other than for the achievements, though, as it limits the deckbuilding too much.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org3f1cc85" class="outline-2">
<h2 id="org3f1cc85">Snipperclips</h2>
<div class="outline-text-2" id="text-org3f1cc85">
<p>
A favorite for couch coop. Adorable and requires all players to contribute.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org56d2bc9" class="outline-2">
<h2 id="org56d2bc9">Sonic Adventure</h2>
<div class="outline-text-2" id="text-org56d2bc9">
<p>
Unredeemable. There was no part of this I enjoyed.
</p>

<p>
1/5
</p>
</div>
</div>
<div id="outline-container-org17f9d0b" class="outline-2">
<h2 id="org17f9d0b">Sonic Colors (DS)</h2>
<div class="outline-text-2" id="text-org17f9d0b">
<p>
Serviceable 2D <i>Sonic</i>.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org4a21398" class="outline-2">
<h2 id="org4a21398">Sonic Mania</h2>
<div class="outline-text-2" id="text-org4a21398">
<p>
The platonic ideal Sonic game, with delightful throwback graphics and soundtrack with top-notch level design. Unfortunately, the Sonic formula is fundamentally flawed. The game wants you to fly through levels, but without replaying and memorizing levels, the gameplay is either effectively an autoscroller or failing to go fast by hitting obstacles or falling.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org4a4bb1d" class="outline-2">
<h2 id="org4a4bb1d">South Park: The Fractured But Whole</h2>
<div class="outline-text-2" id="text-org4a4bb1d">
<p>
A bit less funny than its predecessor, but with a massively more interesting combat system. The difficulty slider is one of my favorite bits of social commentary the show has done.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgc37c61c" class="outline-2">
<h2 id="orgc37c61c">South Park: The Stick of Truth</h2>
<div class="outline-text-2" id="text-orgc37c61c">
<p>
As a playable <i>South Park</i>, very funny and worthwhile. More of a joke RPG than a real RPG though.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgca9bce4" class="outline-2">
<h2 id="orgca9bce4">Spec Ops: The Line</h2>
<div class="outline-text-2" id="text-orgca9bce4">
<p>
Overlook the painfully generic and slightly buggy cover shooter for the engaging narrative.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org35ffcf6" class="outline-2">
<h2 id="org35ffcf6">Splatoon 2</h2>
<div class="outline-text-2" id="text-org35ffcf6">
<p>
I&rsquo;m generally not big on multiplayer shooters, but the lack of a deathmatch and the weapon variety, as well as the new PVE mode, kept me coming back. Underrated soundtrack reminiscient of The Go! Team.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org5bd706c" class="outline-2">
<h2 id="org5bd706c">Stardew Valley</h2>
<div class="outline-text-2" id="text-org5bd706c">
<p>
When I had about 30 minutes before bed after struggling with problem sets all day in my first year of grad school, I would go to a simpler place, where life was a jam-packed gameplay loop of farming, fishing, foraging, and friendship. And the later addition of coop made for one of my favorite couple&rsquo;s games.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org652031f" class="outline-2">
<h2 id="org652031f">Star Fox 64</h2>
<div class="outline-text-2" id="text-org652031f">
<p>
As a genre novice, definitely my favorite rail shooter. Filled with details that reward replay like branching paths and secret segments, and of course, a simple, engaging scoring mechanism. I know every word of the script.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org0b15779" class="outline-2">
<h2 id="org0b15779">Star Wars: Knights of the Old Republic</h2>
<div class="outline-text-2" id="text-org0b15779">
<p>
It&rsquo;s very dated, coming from the olden days of BioWare, but it&rsquo;s also one of the better <i>Star Wars</i> story in the entire Expanded Universe (before Disney killed it).
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org2189ec6" class="outline-2">
<h2 id="org2189ec6">Star Wars: Knights of the Old Republic II</h2>
<div class="outline-text-2" id="text-org2189ec6">
<p>
More of the same, but a bit weaker in the story department.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org2d81f9a" class="outline-2">
<h2 id="org2d81f9a">SteamWorld Dig 2</h2>
<div class="outline-text-2" id="text-org2d81f9a">
<p>
There&rsquo;s not a bad SteamWorld game out there, and this is an unremarkable (but fun!) platformer.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgdd57d68" class="outline-2">
<h2 id="orgdd57d68">SteamWorld Heist</h2>
<div class="outline-text-2" id="text-orgdd57d68">
<p>
<i>XCOM</i> meets <i>Worms</i> does it for me.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org097407c" class="outline-2">
<h2 id="org097407c">Sunset Overdrive</h2>
<div class="outline-text-2" id="text-org097407c">
<p>
Was looking for stupid fun. Got a lot of stupid, some fun.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org3c924a6" class="outline-2">
<h2 id="org3c924a6">SUPERHOT</h2>
<div class="outline-text-2" id="text-org3c924a6">
<p>
Ostensibly a shooter, but the central conceit of a shooter where time only passes when you move ends up making it more of a puzzler. The story gets in the way a bit and is nowhere close to as clever as it thinks it is. Completely superseded by its VR version.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgd2a956e" class="outline-2">
<h2 id="orgd2a956e">SUPERHOT: MIND CONTROL DELETE</h2>
<div class="outline-text-2" id="text-orgd2a956e">
<p>
A roguelike SUPERHOT is a great concept, but the lack of content and amount of replaying levels necessary upon failure made me lose interest.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org110ba0e" class="outline-2">
<h2 id="org110ba0e">SUPERHOT VR</h2>
<div class="outline-text-2" id="text-org110ba0e">
<p>
It&rsquo;s <i>The Matrix</i> in a game, with the immediacy and intuitiveness afforded by VR. By far, the coolest I have ever felt while playing a video game. (&ldquo;Felt&rdquo; is doing a lot of work in that sentence. I&rsquo;ve seen video of me playing.)
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgd76e088" class="outline-2">
<h2 id="orgd76e088">Super Mario 3D Land</h2>
<div class="outline-text-2" id="text-orgd76e088">
<p>
As inoffensive and uninspired as the worst of the <i>NSMB</i> games.
</p>

<p>
3/5
</p>
</div>
</div>
