org/2021-09-25-video-game-reviews.org
* Super Mario 64
Although the camera in particular shows its age, it remains a delightful adventure, and the levels are memorable and unique among the series.

5/5
* Super Mario 64 DS
The four character structure is gratuitous and the movement choice is a lesser-of-two-evils between a d-pad and bizarre touch screen joystick emulation, but it's the same great game with a few extra stars.

4/5
* Super Mario Bros.
One of my hottest takes is that by modern standards, the series was unplayable until /Super Mario Bros. 3/. Movement is just too clunky. "Modern" does a lot of work there though, I loved the Game Boy Color port as a kid.

2/5
* Super Mario Galaxy
It would be incredibly unfair to compare it unfavorably to its direct sequel, as this is still one of the best 3D platformers ever.

5/5
* Super Mario Galaxy 2
The best of the mainline games? Higher difficulty and no fluff make a convincing argument.

5/5
* Super Mario Land 2: 6 Golden Coins
Let me put it this way, it holds up better than the original. Movement is everything in a Mario game, and /Super Mario Land 2/ feels good.

4/5
* Super Mario Odyssey
Fun (and stars) in every carefully crafted nook and cranny.

5/5
* Super Mario Sunshine
Between F.L.U.D.D. and Mario not having any momentum, /Sunshine/ has the best movement in the entire series. World design and many of the shines are also impeccable. Unfortunately, it's clear they ran out of time with some of the repetitive content, especially the blue coins.

4/5
* Super Meat Boy
I'm fine with tough games with instant retries and short levels or checkpoints. Impeccable movement, and one of the best pure platformers the medium has seen.

5/5
* Super Metroid
I can recognize /Super Metroid/ as a genre-defining game. Especially for a first playthrough, it would really benefit from some modern touches; there are way too many destructable blocks (and one glass tunnel...) with no indication of what they are. The controls are terrible and Samus' movement is slow and clunky. What it gets right are a constant sense of progression and its atmosphere, especially [[https://www.youtube.com/watch?v=Q9ieYLHc1fQ][the music]]. The one silver lining of a first playthrough in 2021 is that even the built-in Switch emulator supports save stats to make things less frustrating. Without that, I'd probably have to knock off another point.

4/5
* Super Monkey Ball
Is it a party game or the monkey-rolling equivalent of a precision platformer? It's both, and hits it out of the park. Features a surprisingly strong mini game collection as well, especially Monkey Target.

4/5
* Super Monkey Ball: Banana Blitz
Why would you take a precision monkey-rolling game into a wonky motion-controlled exercise in frustration? With a jump button, no less.

2/5
* Super Paper Mario
It's a mediocre action game. Very funny when it wants to be, and the story is downright OK, high praise for the plumber.


3/5
* Super Smash Bros. (3DS)
An impressive technical achievement, scaling the full /SSB4/ experience onto a handheld. Single-player not as compelling as /Ultimate/'s, and the level 9 AI in particular is notorious for reading inputs.

4/5
* Super Smash Bros. Brawl
The story mode was oddly high budget, but the slower pace as a concession to the Wii's poor online is too steep a price. Also, tripping? I get what Sakurai wanted to do, but randomly robbing the player of control in a fighting game is just bad design. More than a decade later, I remain upset at the time when my character tripped into the final level of All-Star Mode when I wanted to heal. I did not win.

4/5
* Super Smash Bros. Melee
Even as a casual player (I mean, I beat Event 51, but I also mained Roy for his neutral B, so yeah), the roster size and many modes made this an absolute staple of game nights for people of all abilities.

5/5
* Super Smash Bros. (N64)
Downright rudimentary compared to what was yet to come, but the fundamentals are all here.

4/5
* Super Smash Bros. Ultimate
I'm not a fan of fighting games, but I make an exception for /SSB/. Lives up to its title in terms of content. An epic love letter to all of video gaming, and a fun, frantic fighter to boot.

5/5
* Super Street Fighter IV
Won't make any new fans of the fighting genre, but the best since /II/.

3/5
* Team Fortress 2
At some point, Valve described it as "the world's #1 war-themed hat simulator," but that's a little on the nose. The sum of the new content detracts from the rock-paper-scissors of the base game, even though some of the class updates, like for the Medic and Pyro, made them more interesting and fun to play.

4/5
* The Binding of Isaac: Rebirth
My favorite roguelike on the strength of its variety of content, in spite of its complete indifference towards fairness or balance and distasteful themes. The various expansions have only added to the sheer amount of stuff, but the many new paths and bosses bloat the game somewhat, and 60+ minute runs completely overstay their welcome.

4/5
* The Elder Scrolls V: Skyrim
An open-world timesink. There are better RPGs on tables and on screens and the world is soulless, with all your accomplishments feeling hollow as the game barely acknowledges them.

3/5
* The Legend of Zelda: Breath of the Wild
If I could /Eternal Sunshine of the Spotless Mind/ myself for any game, it would be this one. I have not felt this childlike sense of wonder in a game since I was a literal child.

5/5
* The Legend of Zelda: Link's Awakening (2019)
The dungeons are tight, but it's a short game and the stuff in between them (looking at you, animal trade quest) drags. Why on earth can this not always maintain 60 FPS?

3/5
* The Legend of Zelda: Ocarina of Time
A landmark in gaming and an epic adventure even today. The low framerate is awful, but the 3DS port solves that.

4/5
