_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-org8114c39" class="outline-2">
<h2 id="org8114c39">Super Mario 64</h2>
<div class="outline-text-2" id="text-org8114c39">
<p>
Although the camera in particular shows its age, it remains a delightful adventure, and the levels are memorable and unique among the series.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org02c8c0a" class="outline-2">
<h2 id="org02c8c0a">Super Mario 64 DS</h2>
<div class="outline-text-2" id="text-org02c8c0a">
<p>
The four character structure is gratuitous and the movement choice is a lesser-of-two-evils between a d-pad and bizarre touch screen joystick emulation, but it&rsquo;s the same great game with a few extra stars.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgd5d4226" class="outline-2">
<h2 id="orgd5d4226">Super Mario Bros.</h2>
<div class="outline-text-2" id="text-orgd5d4226">
<p>
One of my hottest takes is that by modern standards, the series was unplayable until <i>Super Mario Bros. 3</i>. Movement is just too clunky. &ldquo;Modern&rdquo; does a lot of work there though, I loved the Game Boy Color port as a kid.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-orga9aab6f" class="outline-2">
<h2 id="orga9aab6f">Super Mario Galaxy</h2>
<div class="outline-text-2" id="text-orga9aab6f">
<p>
It would be incredibly unfair to compare it unfavorably to its direct sequel, as this is still one of the best 3D platformers ever.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org451f171" class="outline-2">
<h2 id="org451f171">Super Mario Galaxy 2</h2>
<div class="outline-text-2" id="text-org451f171">
<p>
The best of the mainline games? Higher difficulty and no fluff make a convincing argument.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org7735270" class="outline-2">
<h2 id="org7735270">Super Mario Land 2: 6 Golden Coins</h2>
<div class="outline-text-2" id="text-org7735270">
<p>
Let me put it this way, it holds up better than the original. Movement is everything in a Mario game, and <i>Super Mario Land 2</i> feels good.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org58619f3" class="outline-2">
<h2 id="org58619f3">Super Mario Odyssey</h2>
<div class="outline-text-2" id="text-org58619f3">
<p>
Fun (and stars) in every carefully crafted nook and cranny.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgadbd68f" class="outline-2">
<h2 id="orgadbd68f">Super Mario Sunshine</h2>
<div class="outline-text-2" id="text-orgadbd68f">
<p>
Between F.L.U.D.D. and Mario not having any momentum, <i>Sunshine</i> has the best movement in the entire series. World design and many of the shines are also impeccable. Unfortunately, it&rsquo;s clear they ran out of time with some of the repetitive content, especially the blue coins.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org4fecc34" class="outline-2">
<h2 id="org4fecc34">Super Meat Boy</h2>
<div class="outline-text-2" id="text-org4fecc34">
<p>
I&rsquo;m fine with tough games with instant retries and short levels or checkpoints. Impeccable movement, and one of the best pure platformers the medium has seen.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgd9a9214" class="outline-2">
<h2 id="orgd9a9214">Super Metroid</h2>
<div class="outline-text-2" id="text-orgd9a9214">
<p>
I can recognize <i>Super Metroid</i> as a genre-defining game. Especially for a first playthrough, it would really benefit from some modern touches; there are way too many destructable blocks (and one glass tunnel&#x2026;) with no indication of what they are. The controls are terrible and Samus&rsquo; movement is slow and clunky. What it gets right are a constant sense of progression and its atmosphere, especially <a href="https://www.youtube.com/watch?v=Q9ieYLHc1fQ">the music</a>. The one silver lining of a first playthrough in 2021 is that even the built-in Switch emulator supports save stats to make things less frustrating. Without that, I&rsquo;d probably have to knock off another point.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org117a488" class="outline-2">
<h2 id="org117a488">Super Monkey Ball</h2>
<div class="outline-text-2" id="text-org117a488">
<p>
Is it a party game or the monkey-rolling equivalent of a precision platformer? It&rsquo;s both, and hits it out of the park. Features a surprisingly strong mini game collection as well, especially Monkey Target.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgbeadfaf" class="outline-2">
<h2 id="orgbeadfaf">Super Monkey Ball: Banana Blitz</h2>
<div class="outline-text-2" id="text-orgbeadfaf">
<p>
Why would you take a precision monkey-rolling game into a wonky motion-controlled exercise in frustration? With a jump button, no less.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-orgb36ee11" class="outline-2">
<h2 id="orgb36ee11">Super Paper Mario</h2>
<div class="outline-text-2" id="text-orgb36ee11">
<p>
It&rsquo;s a mediocre action game. Very funny when it wants to be, and the story is downright OK, high praise for the plumber.
</p>


<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org4477a0d" class="outline-2">
<h2 id="org4477a0d">Super Smash Bros. (3DS)</h2>
<div class="outline-text-2" id="text-org4477a0d">
<p>
An impressive technical achievement, scaling the full <i>SSB4</i> experience onto a handheld. Single-player not as compelling as <i>Ultimate</i>&rsquo;s, and the level 9 AI in particular is notorious for reading inputs.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org6c012c4" class="outline-2">
<h2 id="org6c012c4">Super Smash Bros. Brawl</h2>
<div class="outline-text-2" id="text-org6c012c4">
<p>
The story mode was oddly high budget, but the slower pace as a concession to the Wii&rsquo;s poor online is too steep a price. Also, tripping? I get what Sakurai wanted to do, but randomly robbing the player of control in a fighting game is just bad design. More than a decade later, I remain upset at the time when my character tripped into the final level of All-Star Mode when I wanted to heal. I did not win.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgb6de58e" class="outline-2">
<h2 id="orgb6de58e">Super Smash Bros. Melee</h2>
<div class="outline-text-2" id="text-orgb6de58e">
<p>
Even as a casual player (I mean, I beat Event 51, but I also mained Roy for his neutral B, so yeah), the roster size and many modes made this an absolute staple of game nights for people of all abilities.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org940f41b" class="outline-2">
<h2 id="org940f41b">Super Smash Bros. (N64)</h2>
<div class="outline-text-2" id="text-org940f41b">
<p>
Downright rudimentary compared to what was yet to come, but the fundamentals are all here.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orge0fe406" class="outline-2">
<h2 id="orge0fe406">Super Smash Bros. Ultimate</h2>
<div class="outline-text-2" id="text-orge0fe406">
<p>
I&rsquo;m not a fan of fighting games, but I make an exception for <i>SSB</i>. Lives up to its title in terms of content. An epic love letter to all of video gaming, and a fun, frantic fighter to boot.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org929b935" class="outline-2">
<h2 id="org929b935">Super Street Fighter IV</h2>
<div class="outline-text-2" id="text-org929b935">
<p>
Won&rsquo;t make any new fans of the fighting genre, but the best since <i>II</i>.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org065ddea" class="outline-2">
<h2 id="org065ddea">Team Fortress 2</h2>
<div class="outline-text-2" id="text-org065ddea">
<p>
At some point, Valve described it as &ldquo;the world&rsquo;s #1 war-themed hat simulator,&rdquo; but that&rsquo;s a little on the nose. The sum of the new content detracts from the rock-paper-scissors of the base game, even though some of the class updates, like for the Medic and Pyro, made them more interesting and fun to play.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org9f72aa7" class="outline-2">
<h2 id="org9f72aa7">The Binding of Isaac: Rebirth</h2>
<div class="outline-text-2" id="text-org9f72aa7">
<p>
My favorite roguelike on the strength of its variety of content, in spite of its complete indifference towards fairness or balance and distasteful themes. The various expansions have only added to the sheer amount of stuff, but the many new paths and bosses bloat the game somewhat, and 60+ minute runs completely overstay their welcome.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org8ca6e76" class="outline-2">
<h2 id="org8ca6e76">The Elder Scrolls V: Skyrim</h2>
<div class="outline-text-2" id="text-org8ca6e76">
<p>
An open-world timesink. There are better RPGs on tables and on screens and the world is soulless, with all your accomplishments feeling hollow as the game barely acknowledges them.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgb334370" class="outline-2">
<h2 id="orgb334370">The Legend of Zelda: Breath of the Wild</h2>
<div class="outline-text-2" id="text-orgb334370">
<p>
If I could <i>Eternal Sunshine of the Spotless Mind</i> myself for any game, it would be this one. I have not felt this childlike sense of wonder in a game since I was a literal child.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org39f8d78" class="outline-2">
<h2 id="org39f8d78">The Legend of Zelda: Link&rsquo;s Awakening (2019)</h2>
<div class="outline-text-2" id="text-org39f8d78">
<p>
The dungeons are tight, but it&rsquo;s a short game and the stuff in between them (looking at you, animal trade quest) drags. Why on earth can this not always maintain 60 FPS?
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgdf1de72" class="outline-2">
<h2 id="orgdf1de72">The Legend of Zelda: Ocarina of Time</h2>
<div class="outline-text-2" id="text-orgdf1de72">
<p>
A landmark in gaming and an epic adventure even today. The low framerate is awful, but the 3DS port solves that.
</p>

<p>
4/5
</p>
</div>
</div>
