org/2021-09-25-video-game-reviews.org
* The Legend of Zelda: Phantom Hourglass
I could do without the repetitive parts, but it's a full Zelda experience well adapted to the DS.

4/5
* The Legend of Zelda: Skyward Sword
Much has been written about how the game treats the player like an idiot, and it does. I am firmly in the camp that the motion controls here are actively user hostile and was frustrated far more than I was impressed. A handful of good dungeons and bosses with doldrums between them.

3/5
* The Legend of Zelda: Spirit Tracks
/Phantom Hourglass/ with less of the sucky parts. No one ever talks about the DS games, and it's weird to remember that there's a /Zelda/ game about trains.

4/5
* The Legend of Zelda: The Minish Cap
Nintendo let Capcom take the wheel and was rewarded with one of the better 2D efforts in the series. Gorgeous art and sprites.

4/5
* The Legend of Zelda: Twilight Princess
The ultimate realization of the /Ocarina of Time/-style /Zelda/ game. A genuinely epic adventure with highlights in the art, dungeons, and for once in the series, story.

4/5
* The Messenger
Fundamentally as sound as /Shovel Knight/. Pacing suffers a lot due to backtracking in the middle.
Leans too heavily on self-awareness at times.
Main game is a little too easy at the end, but the free DLC is a little too unforgiving and has an awful final boss.

4/5
* The Murder of Sonic the Hedgehog
/Frog Detective/ with less charm.

2/5
* The Stanley Parable
An amusing meta-commentary art game/walking simulator. Has something to say and succeeds in conveying it.

5/5
* The Urbz: Sims in the City (DS)
What exactly is this game? A bizarre blend of /The Sims/, an RPG, and a few minigames?

2/5
* The World Ends With You
I was going to make a comment about the story hurting my head, but I suppose the combat does that just a little more, at least in the original DS version. Like most JRPGs, the lack of interplay between the gameplay and the story hurts it (why isn't this just a comic?), but they're both individually sound.

4/5
* Titanfall 2
An exemplary AAA linear shooter. Movement and boss battles are highlights, with the latter being unusual for a shooter. Weapons and narrative are both generic. Doesn't quite reach the heights of the best of /Halo/, /Call of Duty/, or /Doom (2016)/.

4/5
* Tomb Raider (2013)
Harping on /Tomb Raider/ for ludonarrative dissonance is like shooting fish in a barrel, but was there really no one in testing who found it jarring that immediately after innocent Lara kills a human for the first time in a cutscene, I'm getting bonus points for headshots? A fun cast of characters anchors the story until it decides to go all-in on the supernatural.

4/5
* Tony Hawk's Pro Skater 3
I owned this game before I had a memory card for my PS2, and with an hour limit on screen time per day, I got pretty good at getting through most or all of the campaign in that time. Conveniently, that plays to its strengths of fast, technical arcade skating designed to be replayed.

4/5
* Tony Hawk's Underground
Not nearly as cool as it was when I was in middle school, but the levels, ability to walk, and that soundtrack (Cannibal Ox! DOOM! Queens of the Stone Age!  Madlib! Deltron 3030! Juggaknots! Nas!) are all aces.

4/5
* Tony Hawk's Underground 2
Wasn't cool even when I was in middle school. /THUG/ but worse.

3/5
* Transistor
Both the combat and story are inscrutable for a shockingly large portion of the experience given that this is only a six-hour game. They both mostly get there.

4/5
* Trauma Center: Second Opinion
Surprisingly heavy visual novel with motion-controlled surgery simulations throughout. Superb soundtrack. Glad I replayed this one before covid.

4/5
* Trials HD
Challenging and rewarding physics motorcycle game. Significantly replayable.

4/5
* Triangle Strategy
Although the story branches are filled with weighty, meaningful decisions, I rarely felt like I was making crunchy tactical choices; the key decisions on most maps are strategic: swarming the boss here, defending this area before advancing, etc. Gorgeous style, superb writing, an enjoyable story, a disappointing dub. The totality of the package reminds me of /Path of Radiance/.

4/5
* Tunic
The brilliance is in the in-game manual, with its mysteries and layers.
At the start, it's a loose guide, maintaining a sense of discovery and letting the game be cryptic without sending players to an external guide.
And by the end, it's your only friend in the face of an onslaught of riddles.

5/5
* Undertale
If art is anything that evokes an emotional response, then Undertale is a shining example of games as art. A personal favorite.

5/5
* Unpacking
Some quiet moments of storytelling and social commentary through mechanics. Note that I said mechanics, not gameplay, of which there is effectively none, though it manages to be annoying at times anyway. (Well, that's where /I/ would put the laundry basket.)

4/5
* Valkyria Chronicles
I want to love this for its unique take on the tactical genre, and there are some ideas in there that deserve it. But it is too often a janky, opaque mess that deprives players of vital information, encouraging save scumming and forcing reloads when the developers pull the rug out from under the player. Spends a lot of time answering the question "What if World War II, but anime," resulting in a thematically unholy combination of concentration camps, comic relief winged pigs, clumsy nuclear metaphors, and the female lead wearing an anachronistic bikini.

3/5
* Valkyria Chronicles 4
Despite a better story and a few fun tweaks and additions over the original, it retains every single problem from it. I continue to be baffled by who the intended audience of the gameplay could be, pretending to be a hybrid of turn-based tactics and shooters yet usually playing more like a puzzle game with one right answer that's frustrating to achieve given the clunkiness of the engine.

3/5
