_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-org2e0b240" class="outline-2">
<h2 id="org2e0b240">The Legend of Zelda: Phantom Hourglass</h2>
<div class="outline-text-2" id="text-org2e0b240">
<p>
I could do without the repetitive parts, but it&rsquo;s a full Zelda experience well adapted to the DS.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orge3ba18d" class="outline-2">
<h2 id="orge3ba18d">The Legend of Zelda: Skyward Sword</h2>
<div class="outline-text-2" id="text-orge3ba18d">
<p>
Much has been written about how the game treats the player like an idiot, and it does. I am firmly in the camp that the motion controls here are actively user hostile and was frustrated far more than I was impressed. A handful of good dungeons and bosses with doldrums between them.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgfccb6c4" class="outline-2">
<h2 id="orgfccb6c4">The Legend of Zelda: Spirit Tracks</h2>
<div class="outline-text-2" id="text-orgfccb6c4">
<p>
<i>Phantom Hourglass</i> with less of the sucky parts. No one ever talks about the DS games, and it&rsquo;s weird to remember that there&rsquo;s a <i>Zelda</i> game about trains.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org6ca6750" class="outline-2">
<h2 id="org6ca6750">The Legend of Zelda: The Minish Cap</h2>
<div class="outline-text-2" id="text-org6ca6750">
<p>
Nintendo let Capcom take the wheel and was rewarded with one of the better 2D efforts in the series. Gorgeous art and sprites.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org7459bf8" class="outline-2">
<h2 id="org7459bf8">The Legend of Zelda: Twilight Princess</h2>
<div class="outline-text-2" id="text-org7459bf8">
<p>
The ultimate realization of the <i>Ocarina of Time</i>-style <i>Zelda</i> game. A genuinely epic adventure with highlights in the art, dungeons, and for once in the series, story.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgdd1f05e" class="outline-2">
<h2 id="orgdd1f05e">The Messenger</h2>
<div class="outline-text-2" id="text-orgdd1f05e">
<p>
Fundamentally as sound as <i>Shovel Knight</i>. Pacing suffers a lot due to backtracking in the middle.
Leans too heavily on self-awareness at times.
Main game is a little too easy at the end, but the free DLC is a little too unforgiving and has an awful final boss.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org62d2344" class="outline-2">
<h2 id="org62d2344">The Murder of Sonic the Hedgehog</h2>
<div class="outline-text-2" id="text-org62d2344">
<p>
<i>Frog Detective</i> with less charm.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org278c551" class="outline-2">
<h2 id="org278c551">The Stanley Parable</h2>
<div class="outline-text-2" id="text-org278c551">
<p>
An amusing meta-commentary art game/walking simulator. Has something to say and succeeds in conveying it.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org40cf599" class="outline-2">
<h2 id="org40cf599">The Urbz: Sims in the City (DS)</h2>
<div class="outline-text-2" id="text-org40cf599">
<p>
What exactly is this game? A bizarre blend of <i>The Sims</i>, an RPG, and a few minigames?
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org4474bd5" class="outline-2">
<h2 id="org4474bd5">The World Ends With You</h2>
<div class="outline-text-2" id="text-org4474bd5">
<p>
I was going to make a comment about the story hurting my head, but I suppose the combat does that just a little more, at least in the original DS version. Like most JRPGs, the lack of interplay between the gameplay and the story hurts it (why isn&rsquo;t this just a comic?), but they&rsquo;re both individually sound.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgc33edcf" class="outline-2">
<h2 id="orgc33edcf">Titanfall 2</h2>
<div class="outline-text-2" id="text-orgc33edcf">
<p>
An exemplary AAA linear shooter. Movement and boss battles are highlights, with the latter being unusual for a shooter. Weapons and narrative are both generic. Doesn&rsquo;t quite reach the heights of the best of <i>Halo</i>, <i>Call of Duty</i>, or <i>Doom (2016)</i>.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org6648eb4" class="outline-2">
<h2 id="org6648eb4">Tomb Raider (2013)</h2>
<div class="outline-text-2" id="text-org6648eb4">
<p>
Harping on <i>Tomb Raider</i> for ludonarrative dissonance is like shooting fish in a barrel, but was there really no one in testing who found it jarring that immediately after innocent Lara kills a human for the first time in a cutscene, I&rsquo;m getting bonus points for headshots? A fun cast of characters anchors the story until it decides to go all-in on the supernatural.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgff0d3b6" class="outline-2">
<h2 id="orgff0d3b6">Tony Hawk&rsquo;s Pro Skater 3</h2>
<div class="outline-text-2" id="text-orgff0d3b6">
<p>
I owned this game before I had a memory card for my PS2, and with an hour limit on screen time per day, I got pretty good at getting through most or all of the campaign in that time. Conveniently, that plays to its strengths of fast, technical arcade skating designed to be replayed.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org05b88e9" class="outline-2">
<h2 id="org05b88e9">Tony Hawk&rsquo;s Underground</h2>
<div class="outline-text-2" id="text-org05b88e9">
<p>
Not nearly as cool as it was when I was in middle school, but the levels, ability to walk, and that soundtrack (Cannibal Ox! DOOM! Queens of the Stone Age!  Madlib! Deltron 3030! Juggaknots! Nas!) are all aces.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org1517407" class="outline-2">
<h2 id="org1517407">Tony Hawk&rsquo;s Underground 2</h2>
<div class="outline-text-2" id="text-org1517407">
<p>
Wasn&rsquo;t cool even when I was in middle school. <i>THUG</i> but worse.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgd049f0f" class="outline-2">
<h2 id="orgd049f0f">Transistor</h2>
<div class="outline-text-2" id="text-orgd049f0f">
<p>
Both the combat and story are inscrutable for a shockingly large portion of the experience given that this is only a six-hour game. They both mostly get there.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgefe01ed" class="outline-2">
<h2 id="orgefe01ed">Trauma Center: Second Opinion</h2>
<div class="outline-text-2" id="text-orgefe01ed">
<p>
Surprisingly heavy visual novel with motion-controlled surgery simulations throughout. Superb soundtrack. Glad I replayed this one before covid.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgb826c25" class="outline-2">
<h2 id="orgb826c25">Trials HD</h2>
<div class="outline-text-2" id="text-orgb826c25">
<p>
Challenging and rewarding physics motorcycle game. Significantly replayable.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org02e7077" class="outline-2">
<h2 id="org02e7077">Triangle Strategy</h2>
<div class="outline-text-2" id="text-org02e7077">
<p>
Although the story branches are filled with weighty, meaningful decisions, I rarely felt like I was making crunchy tactical choices; the key decisions on most maps are strategic: swarming the boss here, defending this area before advancing, etc. Gorgeous style, superb writing, an enjoyable story, a disappointing dub. The totality of the package reminds me of <i>Path of Radiance</i>.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org7519af2" class="outline-2">
<h2 id="org7519af2">Tunic</h2>
<div class="outline-text-2" id="text-org7519af2">
<p>
The brilliance is in the in-game manual, with its mysteries and layers.
At the start, it&rsquo;s a loose guide, maintaining a sense of discovery and letting the game be cryptic without sending players to an external guide.
And by the end, it&rsquo;s your only friend in the face of an onslaught of riddles.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgfb88aa9" class="outline-2">
<h2 id="orgfb88aa9">Undertale</h2>
<div class="outline-text-2" id="text-orgfb88aa9">
<p>
If art is anything that evokes an emotional response, then Undertale is a shining example of games as art. A personal favorite.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgb258039" class="outline-2">
<h2 id="orgb258039">Unpacking</h2>
<div class="outline-text-2" id="text-orgb258039">
<p>
Some quiet moments of storytelling and social commentary through mechanics. Note that I said mechanics, not gameplay, of which there is effectively none, though it manages to be annoying at times anyway. (Well, that&rsquo;s where <i>I</i> would put the laundry basket.)
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org5711c0a" class="outline-2">
<h2 id="org5711c0a">Valkyria Chronicles</h2>
<div class="outline-text-2" id="text-org5711c0a">
<p>
I want to love this for its unique take on the tactical genre, and there are some ideas in there that deserve it. But it is too often a janky, opaque mess that deprives players of vital information, encouraging save scumming and forcing reloads when the developers pull the rug out from under the player. Spends a lot of time answering the question &ldquo;What if World War II, but anime,&rdquo; resulting in a thematically unholy combination of concentration camps, comic relief winged pigs, clumsy nuclear metaphors, and the female lead wearing an anachronistic bikini.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org902e624" class="outline-2">
<h2 id="org902e624">Valkyria Chronicles 4</h2>
<div class="outline-text-2" id="text-org902e624">
<p>
Despite a better story and a few fun tweaks and additions over the original, it retains every single problem from it. I continue to be baffled by who the intended audience of the gameplay could be, pretending to be a hybrid of turn-based tactics and shooters yet usually playing more like a puzzle game with one right answer that&rsquo;s frustrating to achieve given the clunkiness of the engine.
</p>

<p>
3/5
</p>
</div>
</div>
