org/2021-09-25-video-game-reviews.org
* VVVVVV
I have a thing for games that understand themselves and what they want to do. /VVVVVV/ knows the limits of its mechanics and creates a tight platformer around them. Short, sweet, to-the-point.

4/5
* WarGroove
Charming derivative of the beloved /Advance Wars/ series. Turns out that's not an amazing formula in a world where /XCOM/ exists.

2/5
* Wario Land 4
Detailed, varied, and challenging. High replayability to boot to find every last collectable.

4/5
* Wasteland 3
Held back by its UX and inadequate tutorialization. Once an external guide or forum thread tells you how to build characters properly, even the Ranger difficulty becomes boringly easy. Nothing in the setting, characters, writing, or plot made me particularly invested.

3/5
* Wii Sports
There's no reason to go back when /Wii Sports Resort/ exists (unless you really like the baseball or boxing games), but this game rocked the world, exposing millions of people to video games. Everyone loved that bowling game. Everyone.

5/5
* Wii Sports Resort
It's a dated tech demo in a world with today's VR systems, and yet it was an easy multiplayer hit with casuals. Nintendo didn't have to put as much love into its world (there's a whole island, and every event takes place somewhere on it in a cohesive world!) or Mii integration, but they did. Surprising depth to some of the games like golf and bowling.

5/5
* Wildfrost
The emphasis on positioning your allies each turn makes it heavily tactical. As with /Monster Train/, having some of your deck consist of allies played once per battle makes it more limited as a deckbuilder than something like /Slay the Spire/, which also hurts longevity. There's a learning curve: the game is unforgiving.

4/5
* Worms Blast
A clunky, boring waste of time.

2/5
* Worms Reloaded
Honestly, its greatest sin is not being /Worms World Party/, the apex of the series.

3/5
* Worms World Party
For my money, the best in the series. The best kind of zany.

4/5
* XCOM 2
It takes /Enemy Unknown/, improves the good parts, and strips out as much of the boring strategic layer as it can. My favorite turn-based tactics game of all time. Huge replayability thanks to the randomized levels, soldiers, and enemies (the latter in the /War of the Chosen/ expansion, which is vital). I live for those turns where the game becomes a challenge to somehow kill all the enemies, or even just survive, and it delivers in spades. Main weakness is the reverse difficulty curve.

5/5
* XCOM: Chimera Squad
While it loses the depth of /XCOM 2/, there's some good tactical puzzle action to be had here, the changes to the formula are enough of a novelty for its runtime.

4/5
* XCOM: Enemy Unknown
Completely outclassed by /XCOM 2/, but it was a revelation coming from Fire Emblem to get to play with destructable environments and line of sight. Improved by the /Enemy Within/ expansion's nudges to avoid turtling.

5/5
* Xenoblade Chronicles II
I played this during the first year of my PhD, perhaps the last time I'll be willing to put up with an unnecessarily long JRPG. But the combat system is a treat, the score is one of my favorites, and then I was in the right mindstate for an inconsequential shonen story.

4/5
* Yakuza 0
Somewhere in the /Saints Row 2/ or /GTA/ mold, confidently and sloppily mixing a crime drama with the tonal potpourri of its side stories. None of the gameplay is especially deep or exciting, which really makes things drag. Long cutscenes, run to pink dot, fight people isn't a great gameplay loop.

2/5
* Yooka-Laylee
What if we took Banjo-Kazooie and removed the tight level design for vast, barren worlds? The version I played at launch was buggy and had a camera that was downright hostile to the player.

2/5
