_posts/2021-09-25-video-game-reviews.html
<div id="outline-container-org355f01f" class="outline-2">
<h2 id="org355f01f">VVVVVV</h2>
<div class="outline-text-2" id="text-org355f01f">
<p>
I have a thing for games that understand themselves and what they want to do. <i>VVVVVV</i> knows the limits of its mechanics and creates a tight platformer around them. Short, sweet, to-the-point.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org67407d9" class="outline-2">
<h2 id="org67407d9">WarGroove</h2>
<div class="outline-text-2" id="text-org67407d9">
<p>
Charming derivative of the beloved <i>Advance Wars</i> series. Turns out that&rsquo;s not an amazing formula in a world where <i>XCOM</i> exists.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org613543e" class="outline-2">
<h2 id="org613543e">Wario Land 4</h2>
<div class="outline-text-2" id="text-org613543e">
<p>
Detailed, varied, and challenging. High replayability to boot to find every last collectable.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org0d1ffb2" class="outline-2">
<h2 id="org0d1ffb2">Wasteland 3</h2>
<div class="outline-text-2" id="text-org0d1ffb2">
<p>
Held back by its UX and inadequate tutorialization. Once an external guide or forum thread tells you how to build characters properly, even the Ranger difficulty becomes boringly easy. Nothing in the setting, characters, writing, or plot made me particularly invested.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgf7c3bcb" class="outline-2">
<h2 id="orgf7c3bcb">Wii Sports</h2>
<div class="outline-text-2" id="text-orgf7c3bcb">
<p>
There&rsquo;s no reason to go back when <i>Wii Sports Resort</i> exists (unless you really like the baseball or boxing games), but this game rocked the world, exposing millions of people to video games. Everyone loved that bowling game. Everyone.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org204f5d0" class="outline-2">
<h2 id="org204f5d0">Wii Sports Resort</h2>
<div class="outline-text-2" id="text-org204f5d0">
<p>
It&rsquo;s a dated tech demo in a world with today&rsquo;s VR systems, and yet it was an easy multiplayer hit with casuals. Nintendo didn&rsquo;t have to put as much love into its world (there&rsquo;s a whole island, and every event takes place somewhere on it in a cohesive world!) or Mii integration, but they did. Surprising depth to some of the games like golf and bowling.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orga17a199" class="outline-2">
<h2 id="orga17a199">Wildfrost</h2>
<div class="outline-text-2" id="text-orga17a199">
<p>
The emphasis on positioning your allies each turn makes it heavily tactical. As with <i>Monster Train</i>, having some of your deck consist of allies played once per battle makes it more limited as a deckbuilder than something like <i>Slay the Spire</i>, which also hurts longevity. There&rsquo;s a learning curve: the game is unforgiving.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgcd81fb5" class="outline-2">
<h2 id="orgcd81fb5">Worms Blast</h2>
<div class="outline-text-2" id="text-orgcd81fb5">
<p>
A clunky, boring waste of time.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org0e9aa2a" class="outline-2">
<h2 id="org0e9aa2a">Worms Reloaded</h2>
<div class="outline-text-2" id="text-org0e9aa2a">
<p>
Honestly, its greatest sin is not being <i>Worms World Party</i>, the apex of the series.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgaa06dcc" class="outline-2">
<h2 id="orgaa06dcc">Worms World Party</h2>
<div class="outline-text-2" id="text-orgaa06dcc">
<p>
For my money, the best in the series. The best kind of zany.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org9509be7" class="outline-2">
<h2 id="org9509be7">XCOM 2</h2>
<div class="outline-text-2" id="text-org9509be7">
<p>
It takes <i>Enemy Unknown</i>, improves the good parts, and strips out as much of the boring strategic layer as it can. My favorite turn-based tactics game of all time. Huge replayability thanks to the randomized levels, soldiers, and enemies (the latter in the <i>War of the Chosen</i> expansion, which is vital). I live for those turns where the game becomes a challenge to somehow kill all the enemies, or even just survive, and it delivers in spades. Main weakness is the reverse difficulty curve.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-orgea41c48" class="outline-2">
<h2 id="orgea41c48">XCOM: Chimera Squad</h2>
<div class="outline-text-2" id="text-orgea41c48">
<p>
While it loses the depth of <i>XCOM 2</i>, there&rsquo;s some good tactical puzzle action to be had here, the changes to the formula are enough of a novelty for its runtime.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgd133278" class="outline-2">
<h2 id="orgd133278">XCOM: Enemy Unknown</h2>
<div class="outline-text-2" id="text-orgd133278">
<p>
Completely outclassed by <i>XCOM 2</i>, but it was a revelation coming from Fire Emblem to get to play with destructable environments and line of sight. Improved by the <i>Enemy Within</i> expansion&rsquo;s nudges to avoid turtling.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org444845b" class="outline-2">
<h2 id="org444845b">Xenoblade Chronicles II</h2>
<div class="outline-text-2" id="text-org444845b">
<p>
I played this during the first year of my PhD, perhaps the last time I&rsquo;ll be willing to put up with an unnecessarily long JRPG. But the combat system is a treat, the score is one of my favorites, and then I was in the right mindstate for an inconsequential shonen story.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org7444e7c" class="outline-2">
<h2 id="org7444e7c">Yakuza 0</h2>
<div class="outline-text-2" id="text-org7444e7c">
<p>
Somewhere in the <i>Saints Row 2</i> or <i>GTA</i> mold, confidently and sloppily mixing a crime drama with the tonal potpourri of its side stories. None of the gameplay is especially deep or exciting, which really makes things drag. Long cutscenes, run to pink dot, fight people isn&rsquo;t a great gameplay loop.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-org649cae3" class="outline-2">
<h2 id="org649cae3">Yooka-Laylee</h2>
<div class="outline-text-2" id="text-org649cae3">
<p>
What if we took Banjo-Kazooie and removed the tight level design for vast, barren worlds? The version I played at launch was buggy and had a camera that was downright hostile to the player.
</p>

<p>
2/5
</p>
</div>
</div>
